import { useParams } from "react-router-dom"
import { FishImage } from "./fish-image";



export const Fish = () => {
    const { fishName } = useParams();
    console.log(fishName, 'fishName')


    
    if ('angel' === fishName) {
        return <>

            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/angel/ангел (9).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/angel/ангел (8).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/angel/ангел (11).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/angel/ангел (18).jpg"
                />
            </div>
            <div className="Text-description"> Рыбы-ангелы - семейство морских рыб среди которых насчитывают свыше 85 видов. Наиболее популярные в Красном море — императорские, королевские, арабские, аравийские. 
Они обладают потрясающе эффектной окраской и считаются одними из самых красивых и грациозных созданий Красного моря и других тропических морей.
Рыбы-ангелы отличаются плоским телосложением и высокой спинкой. Длина рыбок составляет от 6 до 70 см в зависимости от вида. Молодые рыбы-ангелы часто окрашены иначе, чем взрослые особи. 
Рыбы-ангелы обитают в тропических широтах всех мировых морей. Девять видов встречаются в Атлантическом океане, остальные в Индийском и Тихом океанах. Все эти рыбки предпочитают жить вблизи коралловых рифов.
У них весьма разнообразные стратегии по питанию. Некоторые из них всеядны, другие питаются только губками и водорослями. Молодые рыбы-ангелы, иногда, сопровождают более крупных рыб, чистя их чешую.
Рыбы-ангелы живут, как правило, парами или в небольших гаремных группах, состоящих из одного самца и нескольких самок. На рифах у них чёткие ареалы, которые они обороняют от соперников. У крупных представителей семейства размер ареалов может составлять свыше 1000 м², у карликовых они могут составлять лишь одну коралловую колонию. Молодые особи могут жить вместе со зрелыми рыбами. Однако в целом, в отношении сородичей-соперников рыбы-ангелы действуют энергично и агрессивно. 

            </div>
        </>
        
    }


    if ('antias' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/antias/антиас (3).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/antias/антиас (4).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/antias/антиас (8).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/antias/антиас (1).jpg"
                />
            </div>

            <div className="Text-description"> Анти́асы – сказочные огненные окуньки. Встречаются в тропических водах океанов, наиболее широко распространены в Красном море, вдоль восточного побережья Африки, в Персидском заливе и в западной части Тихого океана – в Малайзии, Индонезии, на Гавайях, в Океании.Самые крупные представители рода достигают 29 см в длину, тело окрашено в красный, розовый, оранжевый или желтый цвета. Антиасы являются последовательными протогиническими гермафродитами - все рыбки рождаются самками, но могут менять пол. Этот вид образует сложные социальные структуры, с преобладанием самок. На рифе Антиасы составляют группы, называемые “гаремами”, в которых на одного доминирующего самца приходится до 12 самок. Самцы охраняют отдельные участки территории рифа, и нерестятся с самками своего гарема. Среди самок существует иерархия – в стае присутствует 1-2 главные самки, которые менее ярко окрашены и не занимаются охраной территории и гарема. В случае гибели самца, главная самка меняет пол, и сама становится доминирующим самцом. Антиасы ведут дневной образ жизни, активно кормятся в толще воды зоопланктоном, в первую очередь, ракообразными, а также плавающими личинками донных беспозвоночных животных и икрой рыб. Стаи Антиасов помогают дайверам определить направление течения, так как стая всегда держится в направлении против течения.      </div>
        </>
    }

    if ('cezii' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/cezii/цезии2.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/cezii/цезии5.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/cezii/цезии6.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/cezii/цезии7.jpg"
                />
            </div>
            <div className="Text-description"> Цезии — это стайные коралловые рыбы семейства цезионовых (фузилеров), распространены в Коралловых рифах Индо-Тихоокеанского региона, включая Красное море. Представители вида: лунный цезий и красноморский цезий. Стайные рыбки, живущие в больших группах над рифами, активны днем, а ночью укрываются в кораллах. Максимальная длина: до 35 см. Находятся в постоянном движении, очень активны днем при поиске пищи. Питаются планктоном, широко распространенные над рифами и у их обрывов на глубине от 2 до 25 м. 
Обладают яркой окраской, голубые с тонкими серыми полосками или полосатые цезии сверкают зеркальным светом. Часто образуют огромные стайные облака и известны своей быстрой реакцией на хищников, совершая резкие маневры и меняя направление для дезориентации преследователей. Мимикрия цезий удивительна, они могут при необходимости мгновенно менять цвет, чтобы сливаться с окружающей средой. Также цезии часто посещают рыб-чистильщиков.
Иногда небесно-голубые косяки лунных цезиев проплывают с такой ошеломляющей скоростью, что у дайверов возникает ощущение, что мимо только что пролетел серебряный дождь. 

 </div>
        </>
    }


    if ('dolphin' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/dolphins/дельфин (4).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/dolphins/дельфин (6).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/dolphins/дельфин (3).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/dolphins/дельфин (1).jpg"
                />
            </div>
            <div className="Text-description"> Дельфины — семейство подотряда зубатых китов отряда китообразных класса млекопитающих. Дельфины живут в умеренных и тёплых водах Мирового океана. В Атлантике от широты Южной Гренландии до Южной Африки. В Индийском океане обитают от его северных берегов, включая Красное море, на юг до широты Южной Австралии. В Тихом океане встречается от Японии, Курильской гряды, до Тасмании, Новой Зеландии и Аргентины.
В российских водах встречается в Чёрном море и реже — в Балтийском море. 
В Красном море распространены – афалина, длиннорылый и пятнистый. Увидеть их можно практически везде. Питаются мелкой рыбой. 
Тело дельфина идеально приспособлено для движения в воде с огромной скоростью до 37 км/час. У них очень эластичная и гладкая кожа с маслянистыми выделениями, облегчающими скольжение в воде. Длина дельфинов от 2,3 до 3,7 м, вес 150—300 кг. У большинства дельфиновых до 272 зубов — это рекорд для млекопитающих.
Как и все млекопитающие, дельфины дышат воздухом, поэтому они периодически должны подниматься на поверхность воды, чтобы сделать очередной вдох. 
У дельфинов есть свой язык – это ультразвук и различные звуковые импульсы. Наиболее выразительными являются свисты, которых у дельфинов 32 вида – это целая система сигналов, с помощью которых они общаются: сигналы боли, тревоги, приветствия и призывный клич. 
Дельфины улавливают в десять раз более широкий диапазон звуков, чем люди. Человек воспринимает частоты колебаний до 15–20 тысяч в секунду, дельфин — до 150–200 тысяч в секунду.
Дельфины живородящие, мама заботливо охраняет малыша и выкармливает его не менее полугода, а иногда и до двух лет. Растут дельфины медленно, продолжительность их жизни доходит до 30 лет, известны особи возрастом до 50 лет.
</div>
        </>
    }

 if ('dugon' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/dugon/дюгонь (3).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/dugon/дюгонь 2.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/dugon/дюгонь4.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/dugon/дюгонь (7).jpg"
                />
            </div>
            <div className="Text-description"> Дюго́нь — вид водных млекопитающих, единственный из семейства дюгоневых. Дюгонь занесён в Красную книгу, как уязвимый вид. Название «дюгонь» имеет малазийское происхождение, означающее «морская дева» («русалка»).
Дюгони сохранились только в тропическом поясе Индийского и Тихого океанов. В настоящее время наибольшая популяция дюгоней (более 10 000 особей) обитает у Большого Барьерного рифа и в Торресовом проливе. 
Длина тела 2,5 - 4 м, масса достигает 600 кг. Выражен половой диморфизм: самцы крупнее самок. Окраска с возрастом темнеет, становясь тускло-свинцовой или буроватой, брюшко светлее.
Дюгони обитают в тёплых прибрежных водах, мелководных бухтах и лагунах. Держатся над глубинами не более 10 - 20 м. Кормиться дюгони приплывают на мелководье, к коралловым рифам и отмелям, на глубину 1 - 5 м. Основу их рациона составляют водные растения, а также морские водоросли. При кормежке 98 % времени проводят под водой, где «пасутся» максимум 10 -15 минут, затем поднимаются на поверхность для вдоха. По дну часто «ходят» на передних плавниках. В день дюгонь потребляет до 40 кг растительности.
Держатся в одиночку, но над кормными местами собираются группами из 3 - 6 голов. Обычная скорость плавания — до 10 км/ч. Молодые дюгони плавают преимущественно при помощи грудных плавников, взрослые — хвоста.
Дюгони обычно молчаливы. Только возбуждённые и напуганные, они издают резкий свист. Зрение у дюгоней развито слабо, слух — хорошо.
Размножение продолжается круглый год, варьируясь по времени пика в разных частях ареала. Самцы дюгоней сражаются за самок, используя свои бивни. Молочное вскармливание продолжается до 12 - 18 месяцев, хотя уже в 3 месяца молодые дюгони начинают поедать траву. Половая зрелость наступает в 9 - 10 лет, возможно, позже. На молодых дюгоней охотятся крупные акулы, взрослым особям могут представлять угрозу только гребнистые крокодилы и косатки. Продолжительность жизни — до 70 лет.

</div>
        </>
    }

if ('flute' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/flute/дудочка (4).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/flute/флейта.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/flute/дудочка 0.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/flute/дудочка (1).jpg"
                />
            </div>
            <div className="Text-description"> Пятнистая свистулька или рыба-флейта — вид лучепёрых рыб из семейства свистульковых, является крупным дальним родственником морской иглы.
Распространены в Атлантическом океане, в тропических и субтропических водах Индо-Пацифики и Красного моря, среди коралловых рифов.
Рыба-флейта уникальна своим чрезвычайно вытянутым телом, длинным трубкообразным рылом и способностью к маскировке благодаря изменению цвета, рыба использует свое тело как «невидимую» ловушку, зависая вертикально и втягивая мелкую добычу. Может быстро менять свой цвет с коричневого/красноватого на синевато-серый, желтый или зеленый, чтобы лучше сливаться с рифами. Максимальная длина тела рыбы до 200 см, масса тела до 280 грамм. Тело нельзя назвать гибким, и маленький хвост не позволяет ей совершать долгие передвижения. Из-за этого рыбы-флейты ведут малоподвижный образ жизни.
Рыбы-свистульки обитают в прибрежных водах на глубине до 200 м, но чаще охотятся в приповерхностных слоях до глубины 10 м, на склонах коралловых рифов и лугах морских трав. Ведут одиночный образ жизни.
Рыбы-флейты являются активными хищниками. С помощью своего длинного тела, они выхватывают добычу — мелкую рыбу и ракообразных прямо из ветвей кораллов. Они пользуются двумя основными видами охотничьей тактики — либо замирают в вертикальном положении, сливаясь с растительностью, а при появлении ничего не подозревающей жертвы, набрасываются на нее и моментально засасывают, либо прячутся за каким-то крупным обитателем, а иногда даже устраиваются на его спине, крепко уцепившись брюшными плавниками или просто пристраиваются рядом для того, чтобы приблизиться к своей добыче. 

 </div>
        </>
    }

if ('grupper' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/gruppers/группер (8).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/gruppers/группер желтоперый.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/gruppers/группер (6).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/gruppers/групперо.jpg"
                />
            </div>
            <div className="Text-description">Гру́перы - относятся к семейству каменных окуней. В Красном море обитает 19 видов этих рыб. Насчитывается всего 88 видов, распространённых в Индо-Тихоокеанской области, в восточной части Тихого океана, в западной Атлантике, в восточной Атлантике и Средиземном море. Имеют яркую и разнообразную окраску — на тёмном фоне большое количество ярких пятен, полос, точек. Окраска груперов очень изменчива и может меняться в зависимости от конкретной ситуации и окружающих условий].
Хищники с сильновыдвижной верхней челюстью, принимающей форму трубки при открывании рта. Подобное строение рта позволяет груперам с силой засасывать добычу. Питаются мелкими акулами, рыбой, омарами, скатами, молодыми морскими черепахами, подстерегая свою добычу в засаде: расщелине скалы, среди камней, в зарослях водорослей или кораллов.
Длина рыб колеблется от 20 см до более 2,5 м, масса тела — от 100 г до более 450 кг.
Крупные виды, такие как Странствующий групер (270 см), Epinefelus malabaricus (230 см) или Epinephelus itajara (250 см, а вес 455 кг), обитающие в водах тропической части Индийского, Тихого океанов, а также в Атлантическом океане могут представлять опасность для аквалангистов. 
 </div>
        </>
    }

if ('kabuba' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/kabubas/кабуба2.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/kabubas/кабуба 07.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/kabubas/кабуба8.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/kabubas/кабуба11.jpg"
                />
            </div>
            <div className="Text-description"> Кабубы или вымпельные рыбы-бабочки — один из самых узнаваемых и запоминающихся видов рыб семейства щетинозубых, к которому относятся все рыбы-бабочки.
Обитают на коралловых рифах в тропическом поясе Индийского и Тихого океанов от Красного моря и восточного побережья Африки до Гавайев. Самые распространённые виды: Белопёрая кабуба, Красноморская кабуба, Бурая кабуба и Желтохвостая кабуба, все они являются частью семейства рыб-бабочек и отличаются уникальным сочетанием цветов, полос и формы плавников, что делает их легко узнаваемыми обитателями рифов. 
Красноморская кауба - эндемик Красного моря, отличаются темной головой и двумя черными полосами на теле.  
У кабуб высокое плоское тело окрашено в белый цвет с жёлтой областью снизу, голова тёмно-серая, у глаз и в задней части тела проходят две чёрные вертикальные полосы. Уникальная особенность вымпельных кабуб — высокий спинной плавник с очень длинным, нитевидным выростом, напоминающим «вымпел», особенно у самцов. Длина тела рыб от 17 до 30 см.
Питаются в основном зоопланктоном, при случае поедая и донных беспозвоночных. Один из видов - Стайная вымпельная бабочка - питается исключительно зоопланктоном. Кабубы часто встречаются парами или группами, иногда объединяются в стаи на глубинах от 4 до 50 метров у внешних склонов рифов и у песчаного дна, предпочитая зоны с несильным течением. Размножение происходит путем икрометания, как у многих рифовых рыб, причем нерест может сопровождаться ритуалами.
Отличием вида является его миролюбивый характер, эта робкая бабочка никогда не вступает в конфликты с другими рыбами.
</div>
        </>
    }

if ('kuzovok' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/kuzovok/кузовок (8).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/kuzovok/кузовок (3).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/kuzovok/кузовок (7).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/kuzovok/кузовок (1).jpg"
                />
            </div>
            <div className="Text-description"> Кузовковые — семейство лучепёрых рыб из отряда иглобрюхообразных. 
Обитает в тропические водах Тихого, Индийского и Атлантического океанов. Наибольшее число видов у берегов Австралии и Индо-Малайского архипелага. В Красном море встречаются: кузовок-кубик, синехвостый кузовок, белопятнистый кузовок, рогатый и горбатый кузовок. Выделяют 2 вымерших и 8 ныне живущих родов с 25 видами. Различия между родами заключаются в форме поперечного сечения тела, которая может изменяться от почти квадратной до треугольной.
Общая длина тела от 11 см до 55 см, но растут медленно. Тело покрыто «панцирем», который состоит из сросшихся шестиугольных костных пластин. 
Над глазами и за анальным плавником часто встречаются похожие на рога отростки. Глаза двигаются независимо друг от друга. 
Кожа рыб голая, покрыта слизью, содержащей яд — острациотоксин. При опасности, а также стрессе, выделение яда рыбами происходит непосредственно в воду. 
Окраска рыб самая разнообразная, преимущественно яркая, часто с округлыми пятнами различных размеров. 
Встречаются кузовки чаще над песчаным и каменистым дном мелководных защищённых лагун и прибрежных рифов на глубине от 1 до 50-100 метров.
Питаются преимущественно беспозвоночными — оболочниками, голотуриями, морскими ежами, морскими звёздами, крабами, моллюсками, выдувая их из грунта струёй воды, выпущенной изо рта. В рацион ряда видов также входят водоросли и губки.
Плавают очень медленно из-за особенности строения тяжелого панциря.
Проявляют агрессию по отношению к представителям своего или схожих видов.
Брачные игры устраивают открыто, не опасаясь хищников. Жёсткие покровы тела этих рыб не позволяют им раздуваться от икры, поэтому они откладывают немного икринок, которые развиваются в воде. Для вида характерно изменение пола. Изначально мальки превращаются в самок, которые могут стат самцами.
</div>
        </>
    }

if ('lipsfish' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/lips-fish/губан (8).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/lips-fish/губан (3).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/lips-fish/губан (6).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/lips-fish/губан (10).jpg"
                />
            </div>
            <div className="Text-description"> Губановые — семейство лучепёрых рыб из отряда окунеобразных (подотряд губановидные). В семействе губановых 69 родов с 505 видами.
Обитают в прибрежных зонах с кораллами, камнями и водорослями, в водах Атлантического,  Индийского и Тихого океанов, а также многие виды встречаются в Средиземном, Чёрном и Красном морях. 
Среди губановых есть совсем крохотные рыбки, размер которых не превышает 6 - 7 см, и огромные рыбы, длина которых достигает 2,5 метров и массой до 200 кг.
Губановые — это рыбы с удлинённым телом, покрытым крупной циклоидной чешуей. Имеют небольшой выдвижной рот с толстыми и мясистыми губами, на внутренней стороне которых находятся складки. Зубы обычно конической или резцевидной формы.
Расцветка губановых очень разнообразная и яркая. Рыбы могут сочетать в окраске всё многообразие цветовой гаммы. У многих видов цветовая гамма изменяется в течение жизни, молодые особи значительно отличаются от взрослых. Также окрас отличается у самок и самцов. Самки обычно менее яркие и могут иметь совершенно другую расцветку, нежели самцы. Некоторые виды губановых могут флюоресцировать.
Губановые питаются моллюсками, дробя их крепкими зубами, и другими донными беспозвоночными. Есть виды, которые питаются и растительной пищей.
Губаны ведут дневной, одиночный образ жизни, занимают собственный территориальный участок, который рыбка охраняет от других губановых. У всех рыб этого семейства есть интересная особенность — ночной сон, в который они впадают с наступлением темноты. Многие персоны на ночь зарываются в песок, а некоторые, подобно рыбам-попугаям, окутывают себя слизистым коконом.
</div>
        </>
    }

if ('napoleon' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/napoleons/наполеон (1).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/napoleons/наполеон3.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/napoleons/наполеон5.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/napoleons/наполеон (2).jpg"
                />
            </div>
            <div className="Text-description"> Рыба-наполеон — вид морских лучепёрых рыб из семейства губановых. Свое название получил благодаря характерному выступу на голове, напоминающему бикорн Бонапарта.
В красном списке МСОП вид обозначен как находящийся под угрозой. Наполеоны обитают в коралловых рифах Красного моря, тропических районов Индийского и Тихого океанов на глубине от 1 до 100 м.
Взрослые особи вырастают до 230 см, и могут достигать веса до 190 кг. Наполеоны отличаются характерным горбом у самцов, способностью менять пол с самки на самца (протогения), высоким интеллектом, любопытным и дружелюбным характером, а также мощными челюстями для поедания моллюсков и ядовитых рыб. 
Все рыбы-наполеоны рождаются самками, но с возрастом (примерно в 9 лет) могут менять пол на мужской, при этом чешуя меняет цвет с оранжевого на голубой и у рыбы вырастает горб. Половозрелость рыб наступает при длине 35 см. У взрослых рыб толстые, пухлые губы. Окраска тела бледно-зелёная или голубая с зеленоватым или фиолетовым оттенком.
Рыба ведёт дневной и одиночный образ жизни, ночью спит в укрытии между кораллами.  Территориально привязывается к своему ареалу. Наполеон питается рыбами, моллюсками и ракообразными. Это одна из немногих хищных рыб, которые могут потреблять в пищу ядовитые виды. По отношению к человеку Наполеон очень дружелюбен, поэтому многие дайверы обнимают его, когда он медленно дрейфует в толще глубины.
</div>
        </>
    }

if ('nemo' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/nemo/немо (1).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/nemo/немо (2).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/nemo/немо (6).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/nemo/немо5.jpg"
                />
            </div>
            <div className="Text-description">Рыбы-клоуны (Amphiprioninae) — род морских лучепёрых рыб из семейства помацентровых.  28 видов обитают в рифах Индийского и Тихого океанов - от Восточной Африки до Французской Полинезии и от Японии до Восточной Австралии. В водах Красного моря это семейство может похвастаться десятью видами. Рыбки-клоуны обладают огромным разнообразием цветовой окраски, но чаще встречаются яркоокрашенные оранжевые рыбки с черными и белыми полосами, которые всегда живут на морских актиниях – анемонах, и не отдаляются от них более чем на два метра. Взрослые особи достигают размера 12-13 см. Молодые особи всегда меньше старших сородичей, но, если старшая рыба погибает, меньшая начинает расти, чтобы занять её место в семействе. Рыба-клоун начинает жизнь как самец и, в случае нехватки самок самый большой самец меняет пол. Дневная и всеядная рыба-клоун питается зоопланктоном, нитчатыми водорослями и веслоногими ракообразными.

Амфиприон живет в гармонии и в симбиозе с ядовитыми для других видов организмов – полипами Актинии на глубинах до 30 метров. Рыбка чувствует себя в надежном убежище в объятиях щупальцев Актинии, которая прекрасно защищает её от хищников, а рыбки в свою очередь, бережно заботятся о своем хозяине-укрытии, периодически очищая и защищая его. Рыбки-клоуны питаются различными видами планктона и водорослей, проплывающими по течению.
Анимоны "однолюбы", и в течении всей жизни живут парой, и как правило одна пара занимает одну актинию. Рыба является одним из тех представителей, которые живут дольше в дикой природе, чем в неволе. Большинство рыбок-клоунов доживают до 10 лет вокруг своих естественных коралловых рифов и анемонов. Но в аквариуме они живут всего 3-5 лет.


 </div>
        </>
    }

if ('parrot' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/parrot/попугай (6).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/parrot/попугай (2).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/parrot/попугай (7).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/parrot/попугай (8).jpg"
                />
            </div>
            <div className="Text-description"> Рыбы-попугаи — семейство лучепёрых рыб, включающее около 10 родов и 99 видов. Основная среда обитания – тропическая и субтропическая зоны Атлантического, Индийского и Тихого океанов. Рыбы-попугаи обладают большим многообразием цвета, ярких оттенков, строением головы и размерами. Некоторые из них достигают в длину 1,3 м, часто встречаются в зоне коралловых рифов. Редко выходят за пределы ареала распространения кораллов. 
Обитают на глубинах от 0,5 до 15 метров. Как и многие рыбы, населяющие коралловые рифы, рыбы-попугаи являются гермафродитами. Живая яркая окраска меняется при изменении пола. Ярко окрашенные рыбы – это особи мужского пола, тёмные и однотонные – женского.
Питаются твердыми коралловыми полипами, водорослями, но некоторые виды поедают также моллюсков и других донных животных. Рыбы-попугаи получили название за свой «клюв»: их многочисленные зубы плотно расположены на внешней поверхности челюстной кости и напоминают клюв попугая, который позволяет рыбам соскабливать водоросли с кораллов и поверхностей камней. 
С наступлением ночи рыбы выделяют вокруг себя слизь, образуя защитную оболочку, которая препятствует распространению запаха и уберегает их от ночных хищников.
Рыба-попугай не агрессивна, медлительна, совершенно не обращает внимание на плавающих вокруг дайверов и снорклеров, занимаясь своими делами. Однако, кормить их из рук крайне не рекомендуется, благодаря строению челюсти, даже самые мелкие особи способны повредить кожный покров руки человека.
</div>
        </>
    }

if ('platex' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/platex/платакс5.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/platex/платакс7.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/platex/платекс 1.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/platex/платакс9.jpg"
                />
            </div>
            <div className="Text-description"> Платаксы — вид лучепёрых рыб из семейства эфипповых. Платаксы обитают в Атлантическом, Индийском и Тихом океанах. Семейство объединяет до 12 видов.
Платаксы довольно крупные рыбы. Длина тела большинства видов до 45 см. Однако, размер Длиннопёрого платакса может достигать 70 см. Тело высокое, дисковидное, сильно сжатое с боков. Форма тела и цвет очень сильно меняются с возрастом. Молодые рыбы коричневого цвета с яркими оранжевыми полосами и черной полосой по краю тела, и у них очень длинные спинной и анальный плавники, что придаёт рыбе серповидную форму. По мере взросления, плавники укорачиваются, чёрные полосы размываются, тело приобретает однотонную тёмную или серебристую окраску. 
Питаются преимущественно беспозвоночными, такими как ракообразные, кольчатые черви, двустворчатые и моллюски, а также медузами, сальпидами и водорослями.
Молодые рыбы встречаются поодиночке или небольшими группами среди зарослей водорослей и в защищенных лагунах, взрослые рыбы – в глубоких песчаных лагунах, на рифах, обращённых в сторону моря на глубинах от трёх метров до 30 метров, малыми группами платаксы любят глубоководные районы затонувших кораблей. Это не пугливые рыбы, близко подпускают к себе дайверов, иногда проявляют любопытство.
Платаксы играют роль критической функциональной группы, поедая морские водоросли, которые не употребляют другие травоядные рыбы. Тем самым они предотвращают чрезмерно быстрый рост водорослей среди кораллов и дают возможность кораллам расти и поддерживать жизнь рифа. Истощение популяции платаксов в результате рыбной ловли и загрязнения окружающей среды приводит к бурному росту морских водорослей и исчезновению кораллов.

</div>
        </>
    }


 if ('scolopsis' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/scolopsis/scolopsis-ghanam_3.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/scolopsis/scolopsis-ghanam-1.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/scolopsis/scolopsis_0.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/scolopsis/нитепер 02.jpg"
                />
            </div>
            <div className="Text-description"> Сколопсис или нитепёр — это группа морских рыб из семейства нитеперовых. Отличаются длинными нитевидными лучами в плавниках, из-за чего рыбка получила свое название.  Насчитывается около 30 видов морских рыб. Обитают повсеместно в тропических и субтропических зонах Индийского и Тихого океанов.
В Красном море встречаются, арабский и красный нитепёр, отличающийся яркой окраской и являющийся обычным обитателем рифов. 
В пределах видов длина рыб нитепёра различается от 15 до 30 см, однако, среди красных нитеперов, встречаются особи длиной до 100 см и весом до 8 кг. Живут поодиночке или небольшими группами. Преимущественно обитают на небольших глубинах на внешних склонах коралловых рифов у песчаного дна. Питаются ракообразными, моллюсками, мелкими рыбами.
Главная особенность нитепёров — свободные нитевидные лучи грудных плавников. Эти лучи служат высокочувствительными органами осязания и вкуса, с помощью которых рыбы «ощупывают» дно в мутной прибрежной воде, обнаруживая добычу (креветок и мелкую рыбу) в условиях плохой видимости в мутной воде.
Многие представители семейства являются протандрическими гермафродитами. У некоторых видов нитеперов самцы во время ухаживания меняют окраску на более темную и совершают стремительные «танцы», резко раскрывая и складывая свои длинные плавники, чтобы привлечь самку.
</div>
        </>
    }   

    if ('solders' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/soldiers/солдат2.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/soldiers/солдат3.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/soldiers/солдатики5.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/soldiers/солдатики9.jpg"
                />
            </div>
            <div className="Text-description"> Рыбы-солдаты — род лучепёрых рыб из семейства голоцентровых.  Большую часть времени рыбки проводят в укрытии, выстраиваются в группы, похожие на строй, отсюда и название. Иногда их называют “рыба-белка” - из-за больших, похожих на беличьи глаз, облегчающих ночное ориентирование. Распространены в тропических и субтропических водах Индийского, Тихого и Атлантического океанов, с наибольшим разнообразием видов на рифах Индо-Тихоокеанского региона. В состав рода включают 33 вида. В окраске доминируют оттенки красного цвета, который в ночное время становится плохо видимым и играет роль своеобразного камуфляжа. Большинство представителей имеют максимальную длину 15 - 35 см. Но крупные виды, как вооруженная рыба-белка, могут достигать 45-60 см. 
Обитают на глубинах от 1 до 80 метров. Преимущественно ведут ночной образ жизни, днём укрываясь в камнях, расщелинах, пещерах и под навесами коралловых рифов у самого дна, где собирают изопод и других мелких ракообразных.
Держатся поодиночке или небольшими группами. Ночью выходят на участки дна с песчаным грунтом и охотятся на полихет, небольших крабов, а также мелких брюхоногих и двустворчатых моллюсков. Могут формировать плотные группы, напоминающие военный строй, и любопытно выглядывать из укрытий, но быстро прячутся при опасности.
Обычный ареал обитания рыбок в мелких защищённых лагунах и бухтах в непосредственной близости от возможных укрытий. Однако, мальки часто встречаются в открытом океане на большом удалении от берега, и, в некоторых районах они составляют один из обычных компонентов питания океанических хищных рыб.
</div>
        </>
    }   

    if ('tuna' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/tuna/тунец (1).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/tuna/тунец (4).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/tuna/тунец (10).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/tuna/тунец (2).jpg"
                />
            </div>
            <div className="Text-description"> Каранксы – вид морских лучепёрых рыб из семейства ставридовых. Широко распространены в тропических и субтропических водах Индо-Тихоокеанской области. Максимальная длина тела 170 см, обычно до 100 см. Масса тела до 80 кг. Тело удлинённое, немного сжато с боков, покрыто мелкой циклоидной чешуёй. 
У особей длиной менее 50 см голова и тело серебристо-серые, спина темнее, брюхо серебристое. У крупных половозрелых особей наблюдается половой диморфизм. У самцов тело серовато-чёрного или угольно-чёрного цвета. Самки серебристо-серого цвета. 
В Красном море чаще встречаются виды: шестиполосый, синеперый и желтоперый каранксы - это очень активные персоны, охотящиеся стаями у рифов и в толще воды за рыбой, ракообразными и моллюсками. Наиболее активны на рассвете и закате. Взрослые особи обитают в открытых водах, привязаны к индивидуальному участку обитания, который они не покидают в течение нескольких лет (за исключением периода нагула), перемещаясь в пределах участка на расстояние до 9 км. 
Половозрелые особи ведут одиночный образ жизни или образуют небольшие группы, а в преднерестовый и нерестовый сезоны собираются в небольшие стаи. Молодь и неполовозрелые особи ведут стайный образ жизни. 
Взрослые особи агрессивны, зарегистрированы нападения каранксов на рифовых акул. При этом каранксы получают травмы от подобного контакта с акулами, но не прекращают атаки. Причины подобного агрессивного поведения не ясны, поскольку каранксы не питаются акулами. Поэтому при встрече с взрослыми каранксами – лучше держать дистанцию.

</div>
        </>
    }   


    if ('whisperers' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/whisperers/шептуны 1.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/whisperers/шептуны 3.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/whisperers/шептуны 4.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/whisperers/шептуны 5.jpg"
                />
            </div>
            <div className="Text-description"> Рыбы-ворчуны относятся к семейству Сладкогубовых. Обитают стаями на коралловых рифах Атлантического и Индо-Тихоокеанского регионов.

Известно около 20 родов и более 130 видов ворчуновых рыб, среди них разнообразные диаграммы, ворчуны, пристипомы и ронки. Этот вид получил название «рыбы-ворчуны» из-за способности издавать громкие звуки, которые используется для коммуникации, отпугивания хищников и привлечения партнеров. У ворчунов есть сильные глоточные зубы, которыми ворчуны дробят раковины моллюсков. 
Днём взрослые рыбы, как правило, неактивны, прячутся под коралловыми выступами или в расщелинах. 
Они ведут сумеречный/ночной образ жизни, днем прячась в расщелинах и под коралловыми выступами, а их молодь часто отличается яркой пятнистой/полосатой окраской, которая исчезает с возрастом. Эти донные обитатели рифов питаются беспозвоночными, принимая участие в очистке рифов, и могут достигать значительных размеров, но часто сами служат пищей для крупных хищников.
Особенность виргинских ворчунов - они выделяют токсин граммистин для защиты от хищников, что является ключевой особенностью для самообороны и регуляции экосистемы рифов. 
Рыбы-ворчуны достаточно дружелюбны и не боятся любопытных ныряльщиков.
</div>
        </>
    }   

    if ('zebrosoma' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/zebrosoma/зебра 8.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/zebrosoma/зебрасомы (4).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/zebrosoma/зебрасомы (3).jpg"
                />
                <FishImage
                    src="../image/safe-fishes/zebrosoma/зебрасома 77.jpg"
                />
            </div>
            <div className="Text-description"> Зебрасомы — рыбы семейства хирурговых. Обитают в тропических морях Индо-Тихоокеанской области, в Красном море и Персидском заливе. В Красном море встречаются парусные и желтохвостые зебрасомы.
Длина тела рыб составляет от 20 до 40 см. В спинном плавнике 4 - 5 колючих луча и 23 - 31 мягких лучей, и в анальном плавнике - три колючих луча и 19 - 25 мягких лучей. Молодые рыбки окрашены так же, как и взрослые.
Зебрасом можно встретить вдоль склонов лагун и барьерных рифов на глубине до 30 м, но они предпочитают верхние слои воды до глубины 3-5 метров. Обычно они держатся парами, изредка образуя небольшие скопления. Молодь держится поодиночке среди убежищ ветвистых кораллов. Зебрасомы собираются группами для массового нереста, который часто совпадает с фазами луны, пик приходится на конец весны - лето.
Самки выпускают тысячи икринок в воду, где они дрейфуют. Самцы оплодотворяют икру в воде. Икра развивается в пелагических личинок, которые дрейфуют в открытом океане, питаясь микроорганизмами. Личинки претерпевают изменения, превращаясь в маленьких мальков, которые затем оседают на коралловый риф и приобретают вид взрослых рыб. 
Практически все активное время в течение дня зебрасомы проводят в поисках корма, плавая вдоль рифа и поедая произрастающие на твердых субстратах водоросли. 
Особенность зебрасом в наличии острого шипа-скальпеля у хвоста для защиты, который может быть опасен для человека. Отличает их также территориальное поведение и агрессивность к другим рыбам-хирургам. 
</div>
        </>
    }   

    if ('aluter' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/safe-fishes/aluter/алутер0.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/aluter/алутер 00.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/aluter/хвост2.jpg"
                />
                <FishImage
                    src="../image/safe-fishes/aluter/алутер 40.jpg"
                />
            </div>
            <div className="Text-description">Расписной единорог  или алутер — вид морских лучепёрых рыб семейства единороговых отряда иглобрюхообразных.
Это самый крупный единорог, достигающий в длину 110 см. Масса тела — до 2,5 кг. У Расписного алутера первый луч спинного плавника, тонкий и очень нежный, находится прямо над глазом. Удлиненное рыло с заметной вогнутостью. Довольно большой хвостовой плавник закруглен. Основной тон окраски от оливково-коричневого до серого или ржавого с синими линиями и пятнами. Молодые особи желто-коричневого цвета с темным рисунком.
Единороги встречаются в тропических, субтропических и умеренно-теплых водах всех океанов. Обитают на лагунном склоне рифа, а также среди зарослей растительности. Несмотря на крупные размеры, хорошо маскируется. Иногда опускается на глубину до 120 метров. Держится поодиночке. Молодые рыбы часто держатся среди плавающих водорослей, в том числе, саргассовых.
Вид всеядный – потребляет как растительность, так и разнообразных беспозвоночных, включая горгонарий, колониальных актиний и оболочников. 
Рыба ядовита, мясо алутера содержит особый биологический яд — сигуатоксин, и вызывает сигуатеру или чигуатера — сильнейшее пищевое отравление.
 </div>
        </>
    }   

if ('arototron' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/arotron/фугу 00.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/arotron/аротрон (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/arotron/аротрон (6).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/arotron/аротрон (9).jpg"
                />
            </div>
            <div className="Text-description">Аротрон  – этот вид лучепёрых рыб семейства иглобрюхих.
Обитают в водах Красного моря, Индийского и Тихого океанов. В Красном море встречаются: масковый аротрон, звёдчатый иглюбрюх, колючий иглобрюх, белопятнистый аротрон, жемчужный иглобрюх.
Всего насчитывается 15 видов аротронов. Средний размер аротрона – 20 – 40 см. Самый крупный вид может достигать 1,2 м в длину.
Рацион питания иглобрюхов разнообразный – они поедают разные виды моллюсков и ракообразных, сабеллидов, иглокожих, а также рыб, губок, водоросли, наросты на рифах и камнях, причем последние аротрону очень легко соскребать своими необычными зубами. Обитает на глубинах от 1 до 60 метров, чаще на песке и на склонах с обломками кораллов. 
Эти рыбы живут у дна и ведут одиночный образ жизни, охраняя собственный ареал. При возникновении опасности рыба раздувается вдвое, принимая форму шара — втягивая в себя морскую воду. Тело рыб содержит яд – тетродотоксин. 
Аротроны Красного моря уникальны тем, что, будучи рыбами с мощными зубами-пластинами, которые растут непрерывно, они питаются жесткими организмами рифа, постоянно стачивая зубы о твердый субстрат, что необходимо для их выживания. 
Аротроны полезны для экосистемы кораллового мира, так как поедание морских звезд -"тернового венца" помогает регулировать популяцию морской звезды, которая вредит кораллам. Иглобрюхи являются санитарами - разгрызая твердые субстраты, они питаются моллюсками, морскими ежами, губками и другими беспозвоночными, очищая рифы.
 </div>
        </>
    }   

    if ('baracuda' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/baracuda/баракуда (1).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/baracuda/баракуда (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/baracuda/баракуда (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/baracuda/баракуда (6).jpg"
                />
            </div>
            <div className="Text-description"> Барраку́ды — род морских лучепёрых рыб из отряда скумбриеобразных, семейства барраку́довых. 
Обитает почти во всех тёплых морях мира, кроме восточной части Тихого океана. Предпочитает климаты от субтропического до тропического, встречается на мелководьях с рифами, в мангровых зарослях, заливах, у открытых рифов. Взрослые особи могут отдыхать на глубинах до 100 м, но обычно держатся у рифов и на отмелях.
В состав рода включают 28 современных видов. В Красном море встречаются следующие виды: Большая барракуда — самый крупный вид, достигает 1,5–2 метров в длину и весом до 50 кг, Желтохвостая барракуда, Тупорылая барракуда, Чернопёрая баракуда, Большеглазая и Полосатая баракуды.

Внешне барракуда — это массивная, торпедообразная рыба, с массивной нижней челюстью и сильно выступающими острыми зубами.
Взрослые большие барракуды ведут в основном одиночный образ жизни и редко образуют крупные стаи. Молодые особи — часто встречаются в больших косяках, это защищает их от хищников. По мере взросления они становятся одиночками.
Барракуда — высокоэффективный хищник-засадник. Она обладает отличным зрением и наблюдает за потенциальной добычей (мелкой и средней рыбой, креветками и головоногими), а затем резко бросается, нередко разрывая крупного противника на части своими зубами. Мелкую добычу проглатывает целиком, крупную разрезает и съедает по частям. Охота проходит как днём, так и ночью. Стаями обычно охотятся небольшие барракуды, а крупные рыбы - поодиночке. Барракуды способны развивать скорость до 40 км/ч.
Встретив барракуду под водой, дайверы отмечают её осторожность и сильное любопытство: рыба может медленно приближаться, некоторое время следовать за человеком, показывая мощные зубы, а затем уплывать. Такое поведение связано, скорее всего, с интересом, а не с агрессивным поведением.
Барракуды считаются, потенциально, опасными для дайверов или снорклеров. Так как, в мутной воде или в условиях сумерек случайные атаки связаны с ошибочным восприятием барракудой блестящих предметов на человеке. Барракуда принимает блеск за чешую мелкой рыбы, принимая её, как потенциальную добычу. Поэтому рекомендуется не использовать в воде ничего блестящего. Острые зубы барракуды могут серьезно повредить конечности.
</div>
        </>
    }   

    if ('crocodile' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/crocodile/крокодил (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/crocodile/крокодил (1).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/crocodile/крокодил (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/crocodile/крокодил (4).jpg"
                />
            </div>
            <div className="Text-description"> Рыба-крокодил или Плоскоголовов — это донные рыбы из семейства плоскоголовых.
Плоскоголовые широко распространены в тропических и умеренных морях у берегов Юго-Восточной Азии и Австралии, Индийского океана, и у Западной Африки.
Насчитывают до 20 родов с 60 видами плоскоголовых. В Красном море встречаются: бурый плоскоголов и пятнистый плоскоголов.
У плоскоголовых рыб широкая сплющенная голова с костными гребнями и удлиненное, утончающееся к хвосту цилиндрическое тело. Голова снабжена костными гребнями, и плавники - ядовитыми шипами. У некоторых видов на челюстях кроме мелких зубов есть мощные клыки. Максимальная величина плоскоголовых — 120 см и вес 15 кг.

Это малоподвижные донные рыбы прибрежных и умеренно глубоких вод, они держатся на дне и у коралловых рифов, опираясь на грудные и брюшные плавники. Плоскоголовые – хищные рыбы, питаются рыбой и ракообразными. Держится на песчаных и илистых грунтах. 
Рыбы-крокодилы идеально сливаются с песчаным дном, что делает их труднозаметными на охоте в ожидании добычи. Рыбы асолютно не агрессивны.
Неопытному дайверу заметить лежащего на дне рыбу-крокодила не просто. Они очень хорошо маскируются, как правило они практически сливаются с песчаным дном и, если рыба-крокодил лежит без движения, разглядеть её достаточно сложно. Ядовитые шипы на плавниках, при попадании в тело человека могут вызвать сильную боль, паралич и даже удушье, если случайно потревожить её. Поэтому дайверы и снорклеры должны быть предельно внимательны, чтобы не наступить на рыбу-крокодила.
</div>
        </>
    }   

if ('hammerfish' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/hammer-fish/рыба-молот (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/hammer-fish/рыба-молот (7).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/hammer-fish/рыба-молот (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/hammer-fish/рыба-молот6.jpg"
                />
            </div>
            <div className="Text-description"> Молотоголовые акулы или молот-рыбы — семейство хрящевых рыб отряда кархаринообразных акул. 
Встречаются в тёплых тропических водах прибрежных полос и континентальных шельфов, могут заплывать и в открытые воды. В отличие от большинства акул, молот-рыбы часто днём собираются большими стаями, а ночью охотятся в одиночку. Это достаточно крупные акулы, их длина колеблется от 0,9 м (круглоголовая молот-рыба) до 6 м (гигантская акула-молот), а вес от 3 до 580 кг.
Семейство включает 9 видов.
Согласно исследованиям ДНК, предки молотоголовых акул жили в эпоху миоцена около 20 миллионов лет назад. 
Характерный отличительный признак — необычная форма головы, напоминающая молот, поэтому их часто называют рыба-молот. Такая форма головы, улучшает сенсорное восприятие, ноздри позволяют более точно ориентироваться по визуальным сигналам и запаху, а широко расставленные по краям выростов глаза обеспечивают акулам обзор на 360, поэтому они постоянно видят всё, что происходит над и под ними. 
Молот-рыбы — агрессивные хищники, быстрые и сильные пловцы. Они питаются различными донными рыбами, другими акулами, ракообразными и головоногими моллюсками, скатами. С помощью своего «молота» они оглушают и придавливают скатов ко дну. Большеголовые молот-рыбы ведут себя наиболее агрессивно, они нападают на других акул-молотов и даже иногда поедают молодь своего вида].
Молотоголовые размножаются живорождением. Самки приносят потомство один раз в год. В ходе спаривания самцы яростно кусают самок. Как правило, в помёте 12 - 15 новорождённых, однако большеголовые молот-рыбы более плодовиты — у них численность помёта составляет 20 - 40 детёнышей. 
Среди представителей лишь 3 вида могут представлять реальную опасность для человека: бронзовая молот-рыба, гигантская акула-молот и обыкновенная акула-молот. 
В культуре коренных жителей Гавайских островов акулы в целом являются морскими божествами, защитниками людей и регуляторами численности жителей моря. 
Несмотря на размер, молотоголовые акулы очень пугливы, часто охотятся стаями на рыбу и скатов, особенно в сумерках или на рассвете. 
</div>
        </>
    }   

    if ('lionfish' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/lionfish/крылатка (7).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/lionfish/крылатка (1).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/lionfish/крылатка (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/lionfish/крылатка (4).jpg"
                />
            </div>
            <div className="Text-description">Крылатки — род лучепёрых рыб семейства скорпеновых. 
Распространены в подводном мире Индо-Тихоокеанского региона, предпочитая коралловые рифы, лагуны и мелководные зоны с обилием укрытий.
В Красном море, помимо распространенной крылатки-зебры, встречаются антенновая крылатка и лучистая крылатка. 
В состав рода включают 12 видов крылаток. Общая длина тела рыб от 20 см до 46 см. 
Тело продолговатое, сжатое по бокам, покрыто чешуей. В спинном плавнике насчитывается 12 - 13 сильно удлиненных колючих ядовитых лучей. 
Крылатки в Красном море уникальны своей яркой окраской, предупреждающей об опасности, и «крыльями» из веерообразных плавников с острыми ядовитыми иглами. 
Яркие полосы на плавниках служат не только предупреждением, но и маскировкой среди кораллов на охоте. Крылатки активны в сумерках и ночью, в одиночку, а днем прячутся в пещерах и расщелинах.
Это ночные хищники с особыми методами охоты – они загоняют добычу в ядовитые ловушки или маскируются под кораллы, а их ядовитые крылья делают их одним из самых опасных, но красивых обитателей рифов. 
Несмотря на мирный вид, крылатки крайне опасны: их яд силен, а рыба может атаковать, если почувствует угрозу или во время нереста. Приближаться к ним не следует, особенно во время их активной ночной охоты или брачного периода. 
Даже мертвая крылатка сохраняет яд в плавниках, поэтому прикасаться к ней категорически нельзя. 
Яд крылаток токсичен и опасен для человека. Сильнейшую боль от укола вызывают содержащиеся в яде пептиды, действующие на болевые рецепторы. Они разрушаются при нагреве, поэтому рекомендуется окунуть поврежденное место в теплую воду (около 45°C). Помимо боли человек может испытывать тошноту, потливость, одышку, слабость, озноб, непроизвольное сокращение мышц. 
</div>
        </>
    }   

    if ('longwingedfish' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/long-winged-fish/длиннокрылая акула (1).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/long-winged-fish/длиннокрылая акула 2.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/long-winged-fish/длиннокрылая акула (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/long-winged-fish/длиннокрылая акула (4).jpg"
                />
            </div>
            <div className="Text-description"> Длиннокрылая акула — вид акул рода серых акул из отряда кархаринообразных. Обитают в тропических и субтропических водах всех океанов по всему миру от 45° северной широты до 43° южной широты. 
Встречаются на глубине до 230 м. Максимальная длина тела до 4 м, а вес до 165 кг. 
Отличительная черта - грудные плавники длиннокрылых акул значительно длиннее и шире, чем у большинства других видов акул, и заметно округлены. С возрастом окраска длиннокрылых акул существенно меняется: от рождения и до достижения длины примерно 1,2 м отметины на плавниках у них не белые, как у взрослых рыб, а чёрные.
Длиннокрылые акулы считаются наиболее теплолюбивыми акулами, обитающими в поверхностных слоях открытого океана при температуре выше 18 °C. Для них наиболее предпочтительна температура воды от 20°С до 28 °C, когда температура воды снижается, они мигрируют, стремясь покинуть территорию. 
Большую часть времени акулы проводят в верхнем слое океана на глубине до 150 метров на некотором расстоянии от берега. Иногда они подходят близко к берегу и заплывают на мелководье. Как правило, акулы ведут одиночный образ жизни, хотя в местах скопления пищи могут собираться в стаи. У этого вида акул отсутствует суточный цикл, и они проявляют активность и днём, и ночью. Акулы плавают медленно, с распростёртыми грудными плавниками. Их часто сопровождают рыбы — лоцманы, рыбы-прилипалы и корифены. Это вызывает удивление, поскольку хищницы часто поедают этих золотисто-зелёных рыб. 
Длиннокрылые акулы питаются в основном костистыми рыбами, такими как барракуды, ставриды, корифены, марлины, тунцы, макрели, и головоногими моллюсками, а также скатами, морскими черепахами, птицами, брюхоногими, ракообразными и трупами млекопитающих. В ходе охоты акулы проплывают сквозь косяк рыб с разинутой пастью. Охотясь, они становятся агрессивными. 
При наличии добычи длиннокрылые акулы часто образуют стаи и впадают в пищевое безумие — состояние, в котором они начинают неистово рвать зубами любой движущийся объект, в том числе и друг друга. Это конкурентоспособные, приспосабливающиеся хищники, которые используют любой имеющийся пищевой ресурс, вместо того, чтобы искать более лёгкую добычу. 
Длиннокрылые акулы следуют за стаями тунцов или кальмаров, а также за дельфинами и гриндами, подбирая за ними остатки добычи. 
Несмотря на крупные размеры, длиннокрылые акулы могут сами стать добычей, например, они никогда не сопровождают взрослых самцов короткоплавниковой гринды, которые достигают длины свыше 6,5 м и массы 3600 кг. На молодых акул охотятся зубатые киты, тунцы и парусники. 
В северо-западной части Атлантического океана и в юго-западной части Индийского океана брачный сезон начинается в начале лета. Длиннокрылые акулы являются живородящими. Беременность длится один год. В помёте от 1 до 15 новорождённых длиной около 60 см. Самцы и самки достигают половой зрелости при длине 1,7-1,9 м и 1,8-2 м соответственно.
Известный исследователь - океанограф Жак Кусто назвал длиннокрылых акул «самыми опасными из всех акул». Представляют опасность для человека.
</div>
        </>
    }  

        if ('murena' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/murena/мурена (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/murena/мурена (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/murena/мурена (9).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/murena/мурена (10).jpg"
                />
            </div>

            <div className="Text-description">Муре́ны — род лучепёрых рыб из семейства муреновых.
Встречаются в Атлантическом, Тихом и Индийском океанах, широко распространены в Средиземном и Красном морях. 
В Красном море обитают: Гигантская мурена - крупнейшая в Красном море, достигает 3 метров, с леопардовыми пятнами; Волнистая мурена; Жёлторотая мурена. 
Максимальная длина тела представителей разных видов варьирует от 60 до 300 см. Тело змеевидной формы, кожа голая, без чешуи. Разнообразна окраска мурен, помогающая им маскироваться: коричневая, зелёная, зеленовато-жёлтая, пятнистая, полосатая, «мраморная».
Мурены живут в придонном слое воды, почти на дне. Могут жить десятилетиями на одном месте.
Днём они чилят в расщелинах скал или кораллов, высунув головы и лениво следят за происходящим. Ночью мурены выбираются из убежищ, чтобы поохотиться. Обычно они питаются рыбами, но нападают и на ракообразных, и на осьминогов, которых ловят из засады, стрелой выскакивая из своих убежищ и хватая проплывающую мимо жертву.
Мурены Красного моря уникальны своим устрашающим видом и массивной челюстью с острыми зубами, отсутствием чешуи и слизью, обеспечивает животному безопасное и легкое скольжение и проникновение в небольшие пещеры и прочие укрытия, а также защищает мурену от паразитов и повреждений. Слизь может быть ядовитой у некоторых видов. Мурены живут в симбиозе с "чистильщиками" (мелкими рыбами и креветками), которые удаляют остатки пищи и паразитов из их пасти и с тела. Зрение у мурен слабое, зато прекрасно развито обоняние, а внезапная агрессивность может быть связана с испугом, болезнью, или болью от повреждения. 
Некоторые виды являются гермафродитами, меняя пол в течение жизни. 
Мурены не агрессивны, нападают только если чувствуют угрозу или голодны, сытая мурена не тронет дайвера. И все же, лучше держат безопасную дистанцию.  
Укус мурены может быть опасен для человека, так как укусы чрезвычайно болезненны и долго заживают. 


 </div>
        </>
    }  

        if ('seasnake' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/sea-snake/морская змея 3.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sea-snake/морская змея 7.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sea-snake/морская змея 5.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sea-snake/морская змея 8.jpg"
                />
            </div>
            <div className="Text-description"> Морские змеи населяют прибрежные тропические воды Индийского и Тихого океанов, Красного моря. Они встречаются вдоль всего побережья Южной Азии и Восточной Африки, вдоль северного побережья Австралии, во внутренних морях архипелагов Юго-Восточной Азии, в тропической части Тихого океана до Гавайских островов, а у американского побережья — от Калифорнии до Эквадора. 
Морские змеи Красного моря уникальны своей адаптацией к соленой водной среде: у змей есть специальные железы для вывода избытка соли, они дышат легкими (но могут и кожей), имеют сплюснутые хвосты-плавники для плавания и обладают мощным ядом для охоты. От сухопутных змей их отличает - живорождение, то есть самки вынашивают яйца внутри тела и рожают уже полностью сформировавшихся, детенышей. Это позволяет им полностью адаптироваться к водной среде и не нуждаться в суше для репродуктивного цикла.  У многих видов морских змей голова узкая, что позволяет им искать добычу в щелях коралловых рифов. 
Многие морские змеи ядовиты, яд очень силен, часто в десятки раз сильнее, чем у их сухопутных родственников, используется для парализации добычи и защиты.  
Рацион зависит от вида змеи, её размера и местообитания. Молодые особи часто ловят мальков. Взрослые особи питаются мелкой рыбой, мелкими ракообразными, креветками, червями и головоногими моллюсками. 
Имеют яркую окраску для защиты и маскировки в цветных кораллах, активны круглосуточно, могут быть как дневными, так и ночными охотниками. 
Представляет опасность для человека, атаки на людей редки и обычно являются самообороной, укус морской змеи практически безболезненный, однако, яд содержит мощный нейротоксин, который вызывает паралич нервной системы.

</div>
        </>
    }  

        if ('sharksblackfeather' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/sharks-black-feather/черноперая_рифовая_акула_8.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-black-feather/рифовая акула1.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-black-feather/черноперая_рифовая_акула_7.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-black-feather/черноперая_рифовая_акула_4.jpg"
                />
            </div>
            <div className="Text-description"> Чернопёрая рифовая акула или мальга́шская ночна́я аку́ла — вид рода серых акул отряда кархаринообразных. Обитают в тропических водах на коралловых рифах в Индийском и Тихом океанах на глубине до 75 м, предпочитают держаться на мелководье. 
У черноперых рифовых акул торпедообразное, обтекаемое тело. Рыло короткое, широкое и закруглённое. Крупные грудные плавники имеют форму изогнутого узкого серпа и сужаются к кончикам. Их легко опознать по характерному удлинённому телу и чёрным отметинам на кончиках спинных, грудных и хвостового плавников. Максимальная длина 1,8 м, вес 15 кг.
Эти активные хищники охотятся на костистых рыб, головоногих и ракообразных, кальмаров, осьминогов, креветок, каракатиц, а также поедают падаль, мелких акул и скатов. Иногда их добычей становятся морские змеи и птицы. В присутствии сородичей они смелеют и приходят в возбуждение, могут впасть в пищевое безумие. Этот вид акул более активен в ночное время.
Чернопёрые рифовые акулы являются самыми многочисленными акулами, обитающими на коралловых рифах индо-тихоокеанской области. Стремительные и активные акулы встречаются как поодиночке, так и небольшими группами, изредка они собираются в крупные стаи. У некоторых особей наблюдается привязанность к индивидуальному участку обитания, который они не покидают в течение нескольких лет.
Бо́льшую часть времени эти акулы плавают взад-вперёд вдоль края рифа. 
Мелкие особи чернопёрых акул, могут стать добычей крупных рыб, таких как груперы, тёмнопёрые серые акулы, тигровые акулы и крупные сородичи. На акулах паразитируют ленточные черви, слизистые споровики и моногенеи. 
Подобно прочим представителям семейства серых акул, чернопёрые рифовые акулы размножаются путём живорождения, в помете до 6 малышей. Между популяциями наблюдаются существенные различия жизненного цикла в зависимости от ареала обитания. 
Обычно акулы данного вида ведут себя довольно робко, уплывают при появлении человека, и не представляют опасности. Однако известны случаи нападения акул данного вида на людей. 


</div>
        </>
    }  


        if ('sharkscow' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/sharks-cow/бычья акула (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-cow/бычья акула (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-cow/бычья акула (4).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-cow/бычья акула (5).jpg"
                />
            </div>
            <div className="Text-description">Тупорылая акула или бычья акула — вид рода серых акул из отряда кархаринообразных. Обитают в тропических и субтропических водах всех океанов мира. 
Встречаются в прибрежных водах на глубине до 164 м. У них веретенообразное продолговатое тело, рыло короткое, массивное и притупленное. Акулы - быки — самые «коренастые» среди серых акул и сложены крепче своих родственников. Они обладают самым мощным укусом среди всех ныне живущих акул. Бычьи акулы считаются самыми агрессивными среди всех акул.
Акулы - быки достигают довольно крупных размеров. Максимальная зарегистрированная длина составляет около 4 м, а вес — около 360 - 450 кг. 
Тупорылые акулы толерантны к широкому диапазону солёности воды. Часто заходят в пресные воды, вверх по течению рек в Азии, Африки, Америки. В реках Австралии существуют целые популяции этих акул. Они рождаются и растут в пресноводных реках, поэтому молодняку не угрожают хищники. Теоретически тупорылые акулы способны прожить в реке или озере всю жизнь, но этого не происходит, в первую очередь из-за размножения. Молодые акулы-быки уплывают в море, чтобы встретиться с сородичами противоположного пола. Размножаются живорождением. Половая зрелость наступает в возрасте 10-15 лет, в помёте до 13 новорождённых длиной 56 - 81 см.
Часто встречается в Красном море, любит рифы, активна и днем, и ночью, но предпочитает теплые воды и прибрежные зоны. Известна своей территориальностью и агрессивностью, часто охотится в рифовых зонах и на мелководье.
Тупорылая акула способна различать цвета прямо под водой. Было обнаружено, что акулы склонны избегать выделяющихся на фоне дна цветов, особенно ярко-желтых оттенков. Это интерпретируется, как идентификация несъедобных и потенциально опасных объектов.
Это довольно ленивые и медленно плавающие акулы, но во время охоты они становятся довольно активными. Их рацион состоит в основном из костистых рыб и мелких акул, включая даже меньших представителей своего вида. Тупорылые акулы поедают ракообразных, иглокожих, скатов, морских змей и мелких наземных животных, оказавшихся в воде, а также охотятся на морских млекопитающих и небольших морских черепах. Могут нападать на добычу, равную себе по размерам.
Чаще всего они охотятся в одиночку в мутной воде, где жертве труднее заметить приближение хищника. Может менять интенсивность окраски (светлеть или темнеть), чтобы лучше сливаться с окружающей средой. Наряду с живой добычей акулы-быки поедают любые отбросы. Спасаясь от преследования, акулы-быки способны срыгнуть проглоченную пищу. 
У тупорылых акул нет врагов, люди и, возможно, косатки — главная для них угроза. 
Крупный размер, мощные челюсти, агрессивный характер и тот факт, что тупорылые акулы встречаются в мутной воде на мелководье и в реках, вероятно, делают их одним из самых опасных видов акул для человека наряду с тигровой, белой и длиннокрылой акулой. 
 </div>
        </>
    }  

        if ('sharksmaco' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/sharks-maco/акула мако (1).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-maco/акула мако (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-maco/акула мако (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-maco/акула мако (5).jpg"
                />
            </div>
            <div className="Text-description"> Акула-мако — крупная акула семейства сельдевых акул. 
Обитают повсеместно в умеренных и тропических водах всех морей и океанов. Гибралтарский пролив служит естественным питомником для акул данного вида.
Акулы-мако достигают довольно крупных размеров. Максимальная длина взрослых особей может достигать 4,5 м, а масса от 60 до 400 кг. Самки крупнее самцов.
У этих акул стройное веретенообразное тело, вытянутая голова и длинное коническое заострённое рыло. Зубы очень острые, тонкие, без зазубрин по краям, загнуты внутрь. Передние нижние зубы сильно выступают, их хорошо видно даже при закрытой пасти. У акул длиной более 185 см высота первого спинного плавника превышает длину его основания. Рот изогнут в форме буквы U. 
Как и прочие представители семейства сельдевых акул, они могут поддерживать температуру тела выше окружающей среды за счёт эндотермии. Акулы-мако попадаются как у берега, так и в открытом море на глубине до 500 м. Они предпочитают воду температурой не ниже 16 °C. Это типичные обитатели открытого океана считаются наиболее быстрыми из всех существующих акул. Мощные рыбы способны в ходе бросков развивать скорость до 90 км/ч, выпрыгивать из воды на высоту до 6 м и совершать серию прыжков. Перед нападением они могут взъерошивать чешую, усиливая снижение турбулентности. 
В целом, довольно точным признаком присутствия акул-мако являются меч-рыбы, поскольку они обитают в аналогичных природных условиях и являются частью их рациона.

Акулы-мако питаются в основном пелагическими и придонными костистыми рыбами, поедают другие виды акул, морских черепах, скатов, морских коньков, иглобрюхов, рыб-ежей и кузовков. 
В отличие от белых и тигровых акул, они не поедают туши мёртвых китов.
Акулы-мако охотятся в основном у поверхности воды, хотя вблизи берега они могут кормиться и у дна.
В поисках добычи или партнёра для спаривания эти акулы преодолевают большие расстояния. Акулы совершают длительные миграции, особенно в самых северных и южных областях своего ареала. Они склонны следовать за массами тёплой воды, летом перемещаясь по направлению к полюсам.
Размножаются яйцеживорождением с оофагией. 
Это один из самых агрессивных видов акул, который представляет опасность и для человека. 
Размеры, скорость и мощь позволяют этим рыбам нанести людям серьезную угрозу, однако акулы, по-видимому, обычно не рассматривают людей как пищу.
Иногда акулы-мако кусают лодки, по частоте такие случаи стоят на втором месте после инцидентов с белой акулой и даже запрыгивают на борт судна.


</div>
        </>
    }  


         if ('sharksnuss' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/sharks-nuss/акула нянька 2.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-nuss/акула нянька 3.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-nuss/акула нянька 4.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-nuss/акула нянька 1.jpg"
                />
            </div>
            <div className="Text-description">Акулы-няньки — распространённое в солёных водах всего мира семейство акул из отряда воббегонгообразных. Включает 3 монотипических рода. Акулы-няньки распространены в мелких водах тропиков и субтропиков, это неторопливые и покорные обитатели дна. 
У акул-нянек тело цилиндрической формы или слегка сжато, хребты по бокам отсутствуют. Голова широкая и приплюснутая, рыло закруглённое или усечённое. У них мясистые и закруглённые грудные плавники, которые крупнее брюшных плавников. Два спинных плавника одинакового размера или второй чуть меньше.
Наиболее характерная черта всех акул-нянек — это их пасть. Она довольно крупная, поперечная. Такое расположение пасти указывает на донный образ жизни этих акул. Акулы-няньки не нуждаются в постоянном движении для дыхания. Они используют брызгальца, чтобы закачивать воду, и могут лежать неподвижно часами, экономя энергию, что идеально для рифовой среды Красного моря. На нижней челюсти есть 2 мягких усика — это органы обоняния. Ими акула обнюхивает дно в поисках спрятавшейся добычи. Зубы — плоские, треугольные, с пильчатыми краями. Вырастают независимо друг от друга и постоянно меняются в течение всей жизни животного.
Крупнейшая представительница семейства может дорастать до 3 - 4 метров в длину и достигать веса до 250 кг. 
Акулы-няньки распространены обитают на глубине от зоны прибоя до 70 м. Они встречаются на коралловых и скалистых рифах, в песчаных лагунах, мангровых болотах иногда настолько мелких, что вода лишь слегка покрывает их тело.
Акулы-няньки — ночные животные. Днём они спят, собираясь в большие группы до 40 особей в каждой. Каждая акула обычно надолго выбирает себе «своё» укрытие — трещину в камне или место под скалой — и спит в этом укрытии каждый день. Ночью эти акулы охотятся поодиночке. Большую часть времени они кружат низко над дном в поисках добычи. Питаются в основном ракообразными, моллюсками, оболочниками, а также рыбой, в частности скатами-хвостоколами.
Хотя небольшие рты акул-нянек ограничивают размер возможной добычи, с помощью хорошо развитого горла они могут всасывать пищу. Акулы-няньки также едят кораллы и губки.
Большинство акул-нянек — яйцеживородящие. Беременность длится 6 месяцев, в помёте обычно 20 - 30 детёнышей. Акулята рождаются полностью развитыми и пятнистыми, пятна с возрастом пропадают. Длина новорождённых детёнышей усатой акулы-няньки — приблизительно 30 см.
Акулы - няньки не опасны и не агрессивны, но могут укусить, если их спровоцировать или напугать. Поэтому главное правило – не трогать их, сохранять спокойствие и избегать резких движений. Из-за слабого зрения они могут подплывать к людям, чтобы рассмотреть, но это не признак агрессии. 
 </div>
        </>
    }  

        if ('sharkswhite' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/sharks-white/белая акула (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-white/белая акула (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-white/белая акула 5.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-white/белая акула 0.jpeg"
                />
            </div>
            <div className="Text-description">Бе́лая аку́ла или больша́я бе́лая аку́ла — вид хрящевых рыб монотипического рода белых акул семейства сельдевых акул.
Белая акула встречается в поверхностных прибрежных и открытых водах всех океанов Земли (кроме Северного Ледовитого). Является одной из крупнейших хищных рыб на Земле. Некоторые крупные особи регулярно осуществляют длительные трансокеанические путешествия. 
Находится на грани исчезновения — на Земле насчитывается около 3500 особей.

У белой акулы большая голова конической формы и три ряда зубов с зазубренными краями. Подобно прочим акулам, белые акулы обладают органами чувств, которые позволяют им улавливать электромагнитное поле, создаваемое животными. 
Самки крупнее самцов и вырастают до 4 - 4,8 м в длину при массе 680 – 1100 кг., хотя иногда встречаются акулы длиной более 5 метров. Самки крупнее самцов. Половая зрелость у самок наступает в возрасте около 33 лет, у самцов — примерно 26 лет. Продолжительность жизни оценивается приблизительно в 70 лет. 
У белых акул наблюдается иерархическое доминирование по полу, размеру и резидентности: самки доминируют над самцами, крупные акулы — над мелкими, резидентные — над новичками. Во время охоты белые акулы обычно разделяются и разрешают конфликты с помощью ритуалов и демонстративного поведения. Они редко вступают в драку друг с другом. 
Белые акулы патрулируют небольшие архипелаги, населённые ластоногими, рифы, отмели и каменистые мысы, окружённые узким континентальным или островным шельфом, предпочитая прибрежья умеренного климата. Они целеустремлённо двигаются у поверхности или у дна. 
Белые акулы охотятся в основном в дневное время. На всех жизненных этапах белые акулы питаются в основном пелагической, рифовой и донной рыбой. В их рацион также входят китовые, ластоногие, морские рептилии и птицы. Не брезгуют падалью. В некоторых регионах умершие от естественных причин киты являются источником пищи для взрослых белых акул. При охоте на морских млекопитающих охотничья тактика во многом зависит от вида добычи. Нападение происходит так стремительно, что акулы могут почти полностью выпрыгнуть из воды. 
Белые акулы имеют низкий уровень обмена веществ и могут долгое время обходиться без пищи. 
Взрослые белые акулы стоят на вершине пищевой пирамиды, и до недавнего времени считалось, что у них нет естественных врагов. Океанологи установили, что наблюдается межвидовая конкуренция между этим видом акула и косатками в регионах с общей кормовой базой.
Возможность наблюдать вынашивающую потомство белую акулу — чрезвычайно редкое явление. Это обусловлено территориальным обособлением таких самок от мест обычных скоплений белых акул, а также, возможно, очень низкой фертильностью.
У белых акул максимальный размер помёта составляет до 10 акулят.
Учитывая, все особенности вида, считается, что самый опасный для человека вид акул – белые акулы не только в воде, изредка эти акулы нападают на небольшие лодки и даже топят их. 
 </div>
        </>
    }  

    if ('sharkszebra' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/sharks-zebra/зебровая акула 1.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-zebra/зебровая акула 2.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-zebra/зебровая акула 10.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/sharks-zebra/зебровая акула 0.jpg"
                />
            </div>
            <div className="Text-description">Зе́бровая аку́ла — единственный вид семейства зебровых акул. Распространена в тропических и субтропических водах Тихого и Индийского океанов, иногда встречается в южной части Японского моря. 
Занесена в Красную книгу как уязвимый вид, так как страдает от человека, несмотря на свою безвредность.
Длина зебровой акулы может достигать 3 м. Тело цилиндрическое, голова широкая, несколько уплощенная. Брызгальца крупные. Ноздри с короткими усиками. Рот умеренно большой, зубы слабо дифференцированы.
Хвостовой плавник очень длинный, около половины общей длины акулы, причем он не имеет нижней лопасти. Цвет у взрослых особей желто-коричневый с темно-коричневыми пятнами. Молодые особи (до 70 см) окрашены иначе: они темного цвета с белыми пятнами и вертикальными полосами. 
Акула-зебра легко узнаваема благодаря пятнистой окраске, длинному хвосту и продольным гребням на коже по бокам.
Акула отличается ленивым образом жизни - отдыхает днем, лежит на дне, неагрессивным мирным характером, ведет активный ночной образ жизни. 
Питается в основном моллюсками, а также ракообразными и мелкой рыбой.
Использует гибкое тело для проникновения в щели и добывания добычи.
Зебровая акула принадлежит к числу яйцекладущих. Её яйцевые капсулы довольно большие (до 17 см в длину), продолговатые и имеют роговые придатки, которыми они прикрепляются ко дну.
Зебровая акула не агрессивна и опасности для человека не представляет (но, если её спровоцировать, может укусить). 

 </div>
        </>
    }  

    if ('tiggerfish' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/tigger-fish/тигровая акула (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/tigger-fish/тигровая акула (7).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/tigger-fish/тигровая акула (6).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/tigger-fish/акула.jpg"
                />
            </div>
            <div className="Text-description"> Тигро́вая аку́ла или леопардовая акула — единственный представитель хрящевых рыб семейства серых акул отряда кархаринообразных. Один из наиболее распространённых видов акул на Земле.
Широко распространены в тропическом и субтропическом поясе Мирового океана, где обитает как в открытых водах, так и вблизи побережья. 
Ведут кочевой образ жизни, в течение холодных месяцев держатся ближе к экватору, миграции связаны с тёплыми течениями. Этот вид предпочитает глубину, на границе с рифами, но, преследуя добычу, может заплыть на мелководье.
Это одни из крупнейших современных акул. В среднем достигают длины 5 м, при массе в 385 - 630 кг. Самки крупнее самцов. 
Передняя часть тела утолщенная. Крупная голова с большими глазами и коротким тупым рылом имеет клиновидную форму и легко поворачивается из стороны в сторону. Рыло тигровых акул покрыто расширенными порами. Это электрорецепторы, позволяющие им улавливать изменения электрического поля. С помощью боковой линии, которая тянется по бокам вдоль всего тела, акулы засекают малейшие вибрации водной среды. Эти приспособления позволяют им находить добычу и даже охотиться в темноте.
У тигровой акулы очень большой рот с мощными челюстными мышцами и характерные зубы с зазубренными лезвиями. Зубы приспособлены для того, чтобы рассекать даже панцири морских черепах. 
Пока акула не достигнет двухметровой длины, на её боках заметны поперечные полосы, похожие на тигриные — отсюда название. Эти полосы маскируют этих рыб от их более крупных сородичей. 
Активные хищники и прекрасные пловцы, тигровые акулы обычно медленно патрулируют территорию, совершая еле уловимые движения, но становятся быстрыми и подвижными, учуяв пищу. Во время атаки или бегства они мгновенно развивают высокую скорость. Тигровые акулы охотятся в одиночку, в основном ночью, отплывая дальше от берега и поднимаясь ближе к поверхности. 
Очень прожорливы и неразборчивы в еде, акулы пожирают крабов, лангустов, двустворчатых и брюхоногих моллюсков, кальмаров, самых разнообразных рыб, скатов, морских птиц, змей, млекопитающих и черепах. 
Эта акула без излишней брезгливости относится к падали и к отбросам, к останкам касаток и китов. Для этого вида характерен и каннибализм. 
Самки приносят потомство один раз в 3 года. Самка, готовая произвести потомство, теряет аппетит, чтобы избежать каннибализма. Тигровая акула является единственным яйцеживородящим видом в своем семейства. Детёныши вылупляются из зародышевой сумки внутри матери и рождаются, когда полностью разовьются. На период размножения акулы самки собираются в стаи для защиты потомства от самцов. Беременность длится 13 - 16 месяцев. В помёте от 10 до 80 акулят. Продолжительность жизни может достигать 45 - 50 лет. 
В тропических водах тигровая акула представляет собой едва ли не наиболее опасный для человека вид. В среднем на Гавайях происходит 3 - 4 нападения в год, на сёрфингистов и дайверов.
</div>
        </>
    }  

    if ('whalesharks' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/whale-sharks/китовая акула (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/whale-sharks/китовая акула (10).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/whale-sharks/китовая акула6.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/whale-sharks/китовая акула8.jpg"
                />
            </div>
            <div className="Text-description"> Кито́вая аку́ла — крупная пелагическая акула из семейства ринкодонтовых отряда воббегонгообразных. Китовая акула обитает в тёплых водах тропических широт по всему Мировому океану, предпочитают районы океана с температурой воды в приповерхностном слое 21−25 °C и весьма высокой солёностью — 34−35 ‰.
Крупнейшая из существующих в настоящее время видов акул, а также крупнейшая из современных рыб. Её максимальный размер достигает по меньшей мере 12,65 м, возможно, до 20 м. Самки китовой акулы крупнее самцов.
Китовая акула, в отличие от большинства других акул, питается преимущественно одним планктоном - это прежде всего различные организмы размером в несколько миллиметров — ракообразные, мелкие кальмары, медузы. Китовая акула отцеживает корм из воды с помощью особого цедильного аппарата, образованного жаберными дугами. Эта рыба бо́льшую часть времени держится близ поверхности воды. Китовые акулы встречаются обычно небольшими разрозненными группами, реже поодиночке, а изредка, в местах обилия корма, образуют большие скопления в сотни голов. Они совершают весьма далёкие миграции, следуя за сезонными скоплениями планктона. 
Китовую акулу трудно спутать с другими рыбами — помимо огромного размера, её тело мощное и толстое, а голова сравнительно небольшая. Форма головы сильно приплюснутая. Пасть очень широкая, достигающая полутора метров в ширину. Она может раскрываться весьма сильно и при полном размахе приобретает вид широкого овала. 
Количество зубов у китовой акулы чрезвычайно велико и может достигать 15 тысяч. 
Кожа китовой акулы прочная и толстая, у крупных экземпляров достигает толщины 14 см., покрыта очень мелкими плакоидными чешуйками, имеющими вид острых шипов 0,75 мм высотой и 0,5 мм шириной. 
Окраска китовой акулы также весьма характерна. Уникальный пятнистый узор пятен на коже акулы не меняется с возрастом.
Половозрелости эта рыба достигает в возрасте от 30 до 50 лет, продолжительность жизни её весьма велика — до 70 – 100 лет. Китовая акула яйцеживородящая — зародыши развиваются в яйцах-капсулах, вылупляясь из них ещё в утробе.
При рождении акулята имеют очень малый размер, около полуметра. Они обладают значительными внутренними запасами питательных веществ, позволяющими долго обходиться без внешнего источника корма. 
Китовая акула отличается исключительной апатичностью и медлительностью. Рыба предпочитает держаться в приповерхностном слое воды, обычно не глубже 70 м. Китовая акула активна круглые сутки и спит короткими периодами вне зависимости от времени суток.
Существуют данные, что китовых акул на всей Земле осталось лишь около 1 тыс. 
Даже у взрослой китовой акулы нет никаких средств самозащиты, но огромный размер этой рыбы в сочетании с её исключительно толстой и прочной кожей резко сокращает число вероятных хищников, которые могли бы нападать на неё.  Единственным врагом китовой акулы является человек. 
Китовая акула, питающаяся планктоном, в целом рассматривается как не представляющая абсолютно никакой угрозы для людей. Эта инертная, тихая, мягко дрейфующая рыба никогда не нападает на человека, чем охотно пользуются ныряльщики, часто подплывающие вплотную к ней. 
С большим уважением к китовой акуле относятся вьетнамские рыбаки, также считающие встречу с ней благоприятным знаком, называя её с уважительной приставкой, что может быть переведено как «господин Рыба».
</div>
        </>
    }  

    if ('stonefish' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/stone-fish/рыба-камень (5).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/stone-fish/рыба-камень (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/stone-fish/рыба камень 0.webp"
                />
                <FishImage
                    src="../image/dangerous-fishes/stone-fish/рыба-камень (3).jpg"
                />
            </div>
            <div className="Text-description">Борода́вчатка или рыба-камень — морская хищная рыба семейства скорпеновых. 

Обитает в районе южного тропика и встречается на мелководье Тихого и Индийского океанов, от Красного моря до Большого Барьерного рифа в районе австралийского штата Квинсленд, а также в водах Индонезии, Филиппинских и Маршалловых островов, островов Фиджи, Самоа. Это наиболее распространенный вид семейства.

Считается самой ядовитой рыбой в мире.
Максимальная длина тела 40 см. Окраска варьируется от крапчатой зеленоватой до бурой, которая помогает ей прятаться среди камней тропических рифов. Большая голова с маленькими глазами и ртом, направленным вверх, покрыта гребнями и буграми. 12 - 14 толстых колючек спинного плавника снабжены самыми сильными среди рыб ядовитыми железами. Рыба питается в основном мелкой рыбой, креветками и другими ракообразными.
Основное место обитания — на коралловых рифах, возле затемненных водорослей и камней, также может быть найдена отдыхающей в грязи или песке.
Бородавчатка — рыба весьма малоподвижная. Держится на мелких местах вблизи берегов, среди коралловых рифов или лавовых нагромождений. Обычно лежит, забившись в щель между камнями либо зарывшись в ил или песок. Из грунта торчит только верхняя часть головы и спина; к ним прилипают те же травинки, которые окружают рыбу. Заметить её почти невозможно, даже на суше, куда она попадает в большие отливы.

Рыба представляет опасность не только для дайверов на глубине, ядовитая рыба любит отдыхать на берегу в песке и на камнях. Где в песке её очень сложно заметить. При малейшем раздражении бородавчатка поднимает колючки спинного плавника, они легко протыкают обувь человека, случайно наступившего на рыбу, и проникают глубоко в ногу. 
Колючие лучи спинного плавника выпускают токсин. Это наиболее опасная из известных ядовитых рыб, и её яд причиняет сильнейшую боль с возможным шоком, параличом и отмиранием тканей в зависимости от глубины проникновения. При глубоком проникновении укол может стать смертельным для человека, если ему не будет оказана медицинская помощь в течение нескольких часов. Поскольку яд основан на белке, он может быть денатурирован прикладыванием очень горячего компресса к месту ранения.
 </div>
        </>
    }  

    if ('skat' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/скат8.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/скат 11.jpg"
                />
            </div>
            <div className="Text-description"> Хвостоко́лы — род хрящевых рыб семейства хвостоколовых отряда хвостоколообразных надотряда скатов. 
Они обитают во всех тропических и субтропических морях. 
Ведут донный образ жизни. Встречаются в мелких прибрежных водах, заплывают в лагуны, мангровые заросли и солоноватые эстуарии рек. 

Это довольно крупные рыбы, ширина диска достигает 2 м и более. У хвостоколов плоское тело. Грудные плавники срастаются с головой, образуя ромбовидный или овальный диск. Ширина диска, как правило, более чем в 1,3 раза превосходит его длину. Хвост как правило намного длиннее диска, но у некоторых видов он укорочен и утолщён. На хвосте имеется как минимум один ядовитый шип. Глаза скатов расположены сверху. Позади глаз находятся брызгальца — дыхательные отверстия жабр, необходимые для дыхания в песке.
Скаты, как и другие хрящевые рыбы, являются обладателями чувствительных к электрическим полям сенсоров. Эти электрорецепторы позволяют установить местонахождение жертвы и идентифицировать её по специфическим для каждого вида электрическим полям. Зубы скатов образуют толстые пластины, способные вскрыть даже раковины.
Кожа хвостоколов гладкая, почти бархатистая на ощупь. Окраска спины тёмная, коричневатых или серых, иногда грязных тонов. Зачастую спина ската покрыта пятнами, полосами или кольцами. Брюхо светлое.
Большую часть времени скаты - хвостоколы проводят на дне, зарывшись в грунт. Рацион состоит в основном из моллюсков, червей, ракообразных и рыб. В свою очередь хвостоколовые могут стать добычей акул. С помощью своего ядовитого шипа они защищаются от хищников. Сам по себе шип неподвижен, скаты наносят удар, изгибая хвост и действуя им наподобие кнута.
У скатов, как и у всех хрящевых рыб, внутреннее оплодотворение. Скаты-хвостоколы яйцеживородящие.
Поскольку большую часть времени хвостоколовые проводят на дне, зарывшись в грунт, на них можно случайно наступить. Они потенциально опасны для человека благодаря своему ядовитому шипу на хвосте. Яд, проникающий в колотую рану, очень силён. Он вызывает резкие спазмы, кровяное давление падает, начинается сильное сердцебиение, рвота, иногда случаются мышечные параличи. 
</div>
        </>
    }  

     if ('skatorlyak' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (13).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (1).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (15).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (10).jpg"
                />
            </div>
            <div className="Text-description">Обыкновенный пятнистый орляк — вид хрящевых рыб рода семейства орляковых скатов. Широко распространён в тропической зоне, включая Мексиканский залив, Гавайские острова, вдоль побережья западной Африки, в Индийском океане, Океании и вдоль обоих побережий Америки. 

Заходят в лагуны и эстуарии рек. Встречаются от поверхности до глубины 80 м. Ведут одиночный образ жизни, но вне сезона размножения могут формировать стаи до нескольких сотен особей. Большую часть времени проводят, свободно плавая близко к поверхности. Могут перемещаться на большие расстояния в течение суток. 
Имеет уплощенное тело в форме диска. Спинная поверхность окрашена в темно-синий или чёрный цвет с белыми точками, брюшная сторона — белая. Характерная форма плоского рыла напоминает утиный нос. Хвост длиннее, чем у других скатов, и несёт на себе 2 - 6 ядовитых шипов, расположенных сразу за брюшными плавниками. Взрослые особи достигают длины 3,3 м (до 8,8 м с хвостом), ширина диска до 2,5 м, масса тела до 230 кг.
Пятнистые орляки предпочитают воду температурой 24 - 27 °С. Суточные перемещения скатов связаны с приливами, они более активны в период высоких приливов. Для них характерны быстрые движения брюшных плавников, похожие на взмахи. Также наблюдаются такие типы поведения, как ныряние и прыжки. У пятнистых орляков отмечено два типа прыжков. При первом типе рыба выходит из воды вертикально, а затем возвращается в воду по той же траектории. При втором типе скаты на высокой скорости многократно выпрыгивают из воды под углом в 45 градусов. На мелководье или за пределами обычной нагульной территории ведут одиночный образ жизни, но могут образовывать и стаи. Одной из форм перемещения в стае является так называемая «несвязанная агрегация», когда от 3 до 16 скатов плывут в одном направлении с одинаковой скоростью.
Пятнистый орляк, как и другие виды скатов, часто подвергается нападениям акул, таких как тигровая акула, лимонная акула, акула-бык, белопёрая серая акула, гигантская акула-молот. Акулы также преследуют самок скатов в период деторождения и поедают новорожденных.
Пятнистые орляки созревают в возрасте 4 - 6 лет. В сезон размножения демонстрируют своеобразное брачное поведение. Относится к яйцеживородящим организмам, самки вынашивают яйца, а затем на свет появляется молодь, которая выглядит как миниатюрные взрослые особи. Развитие эмбрионов продолжается около одного года. Самка рождает от одного до четырёх детёнышей. Ширина диска новорождённых особей составляет 170 - 350 мм.
Питается преимущественно двустворчатыми моллюсками, включая разнозубых, креветками, крабами, брюхоногими моллюсками и другими бентическими организмами. 
Наблюдается уникальное среди скатов поведение, когда пятнистые орляки закапываются рылом в песок, окружая себя облаком песка, которое извергается через жабры. Таким способом они добывают организмы, зарывающиеся в песок.

Хотя пятнистые орляки обычно избегают встречи с аквалангистами, они все-таки представляют потенциальную опасность из-за наличия ядовитых шипов у основания хвоста. 
В ряде стран предпринимаются меры по сохранению этого вида. Пятнистый орляк имеет охранный статус на Большом Барьерном рифе вдоль восточного побережья Австралии.

 </div>
        </>
    }  

     if ('skatmantu' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (4).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/манта 0.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/манту.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/skat/скат (11).jpg"
                />
            </div>
            <div className="Text-description">Ма́нта или гигантский морской дьявол — вид скатов семейства орляковых отряда хвостоколообразных, надотряда скатов. 
Распространены в тропических, субтропических и умеренных водах Тихого, Атлантического и Индийского океанов между 35° северной широты и 35° южной широты. 

Манты ведут пелагический образ жизни. Совершают длительные миграции до 1100 км, но редко пересекают океан. Способны опуститься ниже 1000 м. Весной и осенью они держатся в прибрежных водах, а зимой уплывают в открытое море. Днём они чаще остаются у поверхности воды на мелководье, а ночью уходят на глубину.

Это самый крупный из скатов, ширина тела отдельных особей достигает 9,1 м (в основной массе 4—4,5 метра), а масса крупных экземпляров — до 3 тонн. Развивают скорость до 30 км/час.
Эти океанодромные рыбы встречаются как в прибрежной зоне, вблизи коралловых рифов и островных групп, так и над глубокими водами на глубине до 120 м вокруг подводных вершин.
Грудные плавники мант срастаются с головой, образуя ромбовидный диск, ширина которого превышает длину. Передняя часть грудных плавников преобразована в так называемые головные плавники. Манты плавают, взмахивая грудными плавниками, как крыльями. В открытом море они двигаются с постоянной скоростью по прямой, а у берега часто греются на поверхности воды или лениво кружат. Встречаются как поодиночке, так и группами, насчитывающими до 30 особей. Их часто сопровождают другие рыбы, а также морские птицы и млекопитающие. По типу питания манты являются фильтраторами. Фильтрующий механизм представляет собой губчатые пластинки розовато-коричневого цвета, расположенные между жаберными дугами.
Манты преодолевают огромные расстояния в поисках пищи, постоянно следуя за перемещением планктона. Они находят пищу, полагаясь на зрение и обоняние.
Эти рыбы питаются зоопланктоном и личинками рыб, мелкими рыбами. Масса пищи, съедаемой еженедельно одной мантой, составляет примерно 13 % от её собственной массы. При наличии исключительно большой концентрации пищи манты способны, наподобие акул, впадать в пищевое безумие.
Подобно прочим хвостоколообразным, манты размножаются яйцеживорождением. В сезон размножения (декабрь — апрель) демонстрируют своеобразное брачное поведение. Эмбрионы развиваются в утробе матери, питаясь желтком и гистотрофом. Беременность длится около года. Рождается один, реже два малыша. Роды проходят на мелководных участках, где молодь затем нагуливается в течение нескольких лет.
На мантах паразитируют веслоногие рачки. Чтобы избавиться от внешних паразитов, манты приплывают в места обитания чистильщиков к коралловым рифам. Чаще всего это происходит во время прилива. Благодаря крупным размерам у мант мало врагов в дикой природе, на них могут напасть только крупные акулы, такие как тигровая акула, гигантская акула-молот и тупорылая акула, а также косатки и малые косатки. Иногда, подобно китам, они по неизвестным причинам совершают прыжки над водой.

Вид не представляет никакой опасности для человека. 

 </div>
        </>
    }  


        if ('tulozure' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/tulozure/тилозур (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/tulozure/тилозур 17.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/tulozure/тилозур (9).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/tulozure/тилозур (1).jpg"
                />
            </div>
            <div className="Text-description">Тилозур — рыба  семейства лучепёрых рыб отряда сарганообразных. 
Представители семейства распространены в умеренных, субтропических и тропических водах всех океанов. 
Размеры представителей семейства варьируют от 4,8 см до 153 см. Питаются в основном мелкими рыбами, в состав рациона также входят ракообразные и мелкие головоногие.

Тело удлинённое, сжато с боков, или округлой, или квадратной формы в поперечном сечении, покрыто мелкой циклоидной, легко опадающей чешуёй. Челюсти длинные, одинаковой длины, образуют характерный «клюв». На обеих челюстях многочисленные игловидные острые зубы. 
Окраска тела большинства представителей семейства обусловлена пелагическим образом жизни вблизи поверхности воды. Верхняя часть тела зеленоватая или голубоватая, а нижняя часть тела и брюхо серебристо-белая. Обычно по бокам тела проходят бледно- или тёмно-синие полосы. 
Тилозуры стаями охотятся на мелкую рыбу вблизи поверхности моря. Тилозур отличается стремительным стилем охоты у поверхности, часто выпрыгивая из воды и пролетая над ней, а также опасен тем, что может поранить людей клювом. Уникальность также в его удивительной способности охотиться стаями и в яркой, но изменчивой окраске, отражающей свет.


 
 </div>
        </>
    }  
    
        if ('surgeon' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/surgeon/хирург (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/surgeon/хирург (3).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/surgeon/хирург (11).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/surgeon/хирург (12).jpg"
                />
            </div>
            <div className="Text-description"> Хиру́рговые — семейство морских лучепёрых рыб отряда хирургообразных, обитающих в тропических водах и субтропических водах (кроме Средиземного моря).
Семейство насчитывает 6 родов и 82 вида, известны с раннего эоцена (55 миллионов лет назад).
Рыбы-хирурги Красного моря — яркие, разнообразно окрашенные рыбы, названные так из-за острых шипов - «скальпелей» у основания хвоста, которые они используют для защиты. Самые известные — Аравийский хирург, эндемик, отличающийся агрессивностью и оранжевым шипом, и Жёлтохвостая зебрасома, синяя с желтым хвостом, они питаются водорослями, помогают очищать рифы и могут быть болезненно-ядовитыми при контакте, поэтому их стоит остерегаться, особенно в местах купания. 
Большинство видов длиной от 15 до 40 см, но есть виды и до 1 м. Тело высокое, сильно уплощённое с боков. Глаза посажены высоко; рот маленький, с одним рядом зубов, приспособленных для питания водорослями.
Отличительной особенностью семейства являются: видоизменённые скальпелеобразные чешуйки-шипы, по одной или более с каждого края хвоста: опасно острые и могут серьёзно ранить при небрежном обращении с рыбой. Спинной, анальный и хвостовой плавники большие, простираются на большую часть длины тела.
Могут быть территориальными или мирными, держатся в группах или поодиночке, сильные пловцы, противостоящие течениям.
Рыбы не агрессивны в отношении человека, хирурги не нападают первыми, но, если их напугать, они могут быстро «пройтись» шипом по ноге, нанося глубокие и болезненные порезы.
</div>
        </>
    }  

        
        if ('balistod' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/spinorog/балистод 8.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/spinorog/спинорог (18).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/spinorog/спинорог9.jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/spinorog/спинорог12.jpg"
                />
            </div>
            <div className="Text-description"> Голубопёрый балистод  — тропическая морская рыба из семейства спинороговых. 
Обитают в Красном море, а также в Индо-Тихоокеанской области от побережья Южной Африки до Японии, островов Лайн, Туамоту и Новой Каледонии.
Голубопёрый балистод длиной около 75 см, весит 10 кг.
Имеют массивное овальное тело с характерным «триггерным» плавником на спине, который рыба может фиксировать в вертикальном положении. У балистода мощные зубы, предназначенные для дробления кораллов и раковин.
Рыбы живут в одиночку или парами в лагунах или на внешних склонах рифов. Их питание состоит в том числе из мадрепоровых кораллов, прежде всего, ветвистых и колючих видов, которые рыба отламывает своей сильной челюстью, а также из морских звёзд, морских ежей, улиток, многощетинковых червей, двустворчатых моллюсков, водорослей и детрита. Добыча, скрывающаяся в песке, добывается при помощи сильной струи воды из своей пасти. Рыба способна ворочать большие каменные глыбы с помощью своего сильного подбородка, чтобы достать спрятавшуюся там добычу. Рыбы очень энергично защищают свой участок от незваных гостей. Это поведение типично для рыбы в период после окончания строительства гнезда, которое самка выкапывает в песке для кладки икры и которое может достигать диаметра почти 2 м и глубины 75 см. Оба родителя, особенно самец, яростно защищают гнездо, нападая на всех, кто подходит близко. После вылупления личинки покидают гнездо, и родительская агрессия прекращается, после чего рыбы становятся мирными.
Опасен в период размножения, известен своей экстремальной агрессивностью. В период охраны гнезда (обычно в песчаных ямках) и длится всего несколько дней, рыба может атаковать дайверов и снорклингистов, заплывших в её зону. У балистода очень мощные зубы, которыми он может нанести болезненные укусы человеку.
</div>
        </>
    }  

        if ('spinorog' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/dangerous-fishes/spinorog/спинорог (14).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/spinorog/спинорог (2).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/spinorog/спинорог (15).jpg"
                />
                <FishImage
                    src="../image/dangerous-fishes/spinorog/спинорог (13).jpg"
                />
            </div>
            <div className="Text-description"> Спиноро́говые или спинороги — семейство морских рыб из отряда иглобрюхообразных.
Семейство насчитывает 12 родов, особи бывают разного размера и разнообразных ярких расцветок. 
Представители семейства населяют тропические и субтропические моря Атлантического, Индийского и Тихого океанов, в первую очередь коралловые рифы. Серый спинорог встречается также в Средиземном море.

Длина тела составляет от 13 см до 1 м. Спинороговые имеют довольно высокое, уплощённое с боков тело. На теле обычно присутствует рисунок из крупных пятен или полос. В окраске встречаются чёрный, голубой, жёлтый, серебристый и белый цвета.
Хищники с мощными зубами, питаются донными беспозвоночными (моллюски, ракообразные, морские ежи, губки, черви, иглокожие), водорослями, детритом, иногда мелкой рыбой и икрой, а для стачивания зубов им необходимо что-то твердое, чтобы они могли дробить раковины и панцири. 
Первый спинной плавник, который в спокойном состоянии сложен и у многих видов незаметен, содержит три больших шипа, из которых самый длинный — первый. Второй шип служит замком. При опасности рыба расправляет плавник, затем второй шип несколько смещается вверх, отчего два первых шипа фиксируются и невозможно сложить спинной плавник, не сломав шипы. Чтобы самой сложить спинной плавник, рыба должна опустить второй шип.
Зубы приспособлены для разгрызания и раскусывания панцирей морских ежей, раковин моллюсков и тому подобного. Охраняя отложенную икру, спинороговые могут вести себя агрессивно и наносить довольно ощутимые укусы ныряльщикам.

</div>
        </>
    }  


        if ('corals' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/corals/кораллы (22).jpg"
                />
                <FishImage
                    src="../image/no-fishes/corals/кораллы (8).jpg"
                />
                <FishImage
                    src="../image/no-fishes/corals/кораллы (7).jpg"
                />
                <FishImage
                    src="../image/no-fishes/corals/кораллы (13).jpg"
                />
            </div>
            <div className="Text-description"> Кора́лловые ри́фы — известковые структуры, образованные колониальными коралловыми полипами и некоторыми видами водорослей. Образуются на мелководье в тропических морях. Основные массивы рифов расположены в морях Юго-Восточной Азии (45 % мировой площади рифов), около 14 % в Атлантике, 17 % в Индийском океане, 18 % в Тихом и 6 % в Красном море.
Большинство коралловых рифов, сформировалось после ледникового периода, таяние льдов привело к повышению уровня моря и затоплению континентального шельфа. Рифы имеют вулканическое происхождение. После затухания вулкана развивается окаймляющий риф. По мере оседания риф становится барьерным и, наконец, превращается в атолл.
Коралловые рифы формируются на неподвижной основе, на глубине до 50 м, в прозрачной, чистой воде тропических морей, при нормальной солёности 30 - 35,18 ‰ и температурой не ниже +20 °C, богатой растворенными газами и планктоном, обеспечивая дыхание и питание полипов. 
Кораллы, образующие риф, можно разделить на ветвистые хрупкие (мадрепоровые) и массивные, скалистые (мозговые и мендриновые кораллы). 
Основу биоценоза подавляющего большинства коралловых рифов составляют шестилучевые мадрепоровые кораллы, восьмилучевые кораллы, гидрокораллы и водоросли. Рифы, на которых преобладают водоросли, губки и мягкие кораллы, находятся в стадии развития.
Кораллы окрашены в самые разнообразные цвета, и сочетать в себе целую гамму оттенков. 
Коралловые рифы образуют одну из важнейших экосистем Мирового океана, и они служат домом для по крайней мере 25 % всех морских видов морских обитателей, местом нереста и созревания молоди многих пелагических рыб.
На рифе живут разнообразные рыбы, морские птицы, губки, стрекающие кишечнополостные, черви, ракообразные, моллюски, иглокожие, асцидии, морские черепахи и змеи. Рифовая биомасса находится в прямой зависимости от биоразнообразия.
Ночные и дневные обитатели рифа сильно отличаются друг от друга: одни и те же укрытия могут регулярно расселяться различными видами в разное время суток.
Некоторые обитатели коралловых рифов снабжают человека ценнейшими лекарствами. Так, вытяжка из асцидий широко применяется в борьбе с вирусными инфекциями, а из вещества, защищающего полипы от солнца, изготавливают препарат для лечения рака кожи.
Коралловые рифы Красного моря, Карибского бассейна и северо-восточного побережья Австралии давно стали меккой для дайверов. 

Большинство живых кораллов очень хрупкие, поэтому крайне не рекомендуется прикасаться к ним. Несмотря на невероятную красоту, многие кораллы опасны по разным причинам. Некоторые, из-за острых краев, которые легко ранят, другие из-за ядовитых стрекательных клеток, вызывающих сильные, долго не заживающие ожоги, с пузырями и язвами. Порезы и ожоги могут инфицироваться, приводя к воспалению, а ожег кораллами вызывает болевой шок и потерю сознания. Самое лучшее решение – наслаждаться красотой на безопасном расстоянии. 


</div>
        </>
    }  

    if ('jellyfish' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/jellyfish/медуза1.jpg"
                />
                <FishImage
                    src="../image/no-fishes/jellyfish/медуза2.jpeg"
                />
                <FishImage
                    src="../image/no-fishes/jellyfish/медузы.jpg"
                />
                <FishImage
                    src="../image/no-fishes/jellyfish/медузы0.jpg"
                />
            </div>
            <div className="Text-description"> </div>
        </>
    }  

        if ('mollusks' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/mollusks/молюск0.jpg"
                />
                <FishImage
                    src="../image/no-fishes/mollusks/конус.jpg"
                />
                <FishImage
                    src="../image/no-fishes/mollusks/молюски (3).jpg"
                />
                <FishImage
                    src="../image/no-fishes/mollusks/молюск(7).jpg"
                />
            </div>
            <div className="Text-description"> Морские моллю́ски — тип первичноротых целомических животных со спиральным дроблением. 
Моллюски распространены по всему земному шару. Наибольшего разнообразия моллюсков в тропических морях. Самые глубоководные моллюски обнаружены в Марианской впадине на глубине около 11 000 м. Появление типа моллюсков датируют началом кембрийского периода.

Около 80 % видов моллюсков относят к классу брюхоногих, около 19 % — к классу двустворчатые, и лишь около 1 % современных видов — к остальным классам.
Брюхоногие – подвижные, двустворчатые – малоподвижные или неподвижные.
Продолжительность жизни у моллюсков сильно варьируется. Многие виды моллюсков живут по нескольку месяцев или даже недель, однако, среди двустворчатых встречаются представители с продолжительностью жизни — свыше 400 лет (океанический венус – живет до 500 лет.)
Моллюски очень разнообразны также по размеру, яркой окраске, по анатомическому строению и поведению, и их образы жизни, развития, питания и размножения также сильно различаются.
По типу питания моллюски делятся на фильтраторов, растительноядных, хищных, паразитов и падальщиков, и их рационы чрезвычайно разнообразны.
В связи с тем, что моллюски — многочисленная и разнообразная группа, их роли в экосистемах также широко варьируют.
Особо велика роль двустворчатых моллюсков как биофильтраторов, очищающих водоёмы от органического загрязнения. Для защиты от хищников морские моллюски нередко секретируют особые химические вещества, действующие на органы химического чувства хищника или жертвы. 
Прочная раковина двустворчатых моллюсков малодоступными для хищников. 
Многие моллюски производят или аккумулируют из окружающей среды токсины, представляющие угрозу для здоровья, а иногда и жизни человека. Отравление может происходить при укусе моллюска или соприкосновении с ним.
Конусы всех видов ядовиты и могут ужалить при прикосновении. Существуют также двустворчатые моллюски, ядовитые для человека, отравление может сопровождаться паралитическим эффектом, потерей памяти, гастроэнтеритами, долговременными нейрологическими расстройствами.
Гигантская тридакна растет вместе с кораллами, становясь частью рифа и, теоретически может представлять опасность для человека, во-первых, из-за острых краёв, а во-вторых, она может зажать створками конечность ныряльщика. 
Моллюски Красного моря уникальны яркой окраской, симбиотическими связями, адаптацией к рифовой среде, а также необычными свойствами.


</div>
        </>
    }  

        if ('octopus' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/octopus/осьминог(2).jpg"
                />
                <FishImage
                    src="../image/no-fishes/octopus/синекольчатый осьминог.jpg"
                />
                <FishImage
                    src="../image/no-fishes/octopus/осьминог (10).jpg"
                />
                <FishImage
                    src="../image/no-fishes/octopus/осьминог (1).jpg"
                />
            </div>
            <div className="Text-description"> Осьмино́ги или спру́товые — самый известный отряд головоногих моллюсков. 
Обитают во всех тропических и субтропических морях и океанах, от мелководья до глубины 100 - 150 м. Предпочитают скалистые прибрежные зоны, отыскивая для обитания пещеры и расщелины в скалах.

Тело у осьминогов короткое, мягкое, сзади овальное. Ротовое отверстие расположено в месте, где сходятся его щупальца. Мантия напоминает морщинистый кожаный мешок. Рот осьминога снабжён двумя мощными челюстями, похожими на клюв попугая. 
У осьминога три сердца: одно гонит голубую кровь по всему телу, а два других — жаберных — проталкивают кровь через жабры.
У осьминогов есть необычная способность — благодаря отсутствию скелета они могут менять форму. Некоторые осьминоги во время охоты распластываются на дне, маскируясь под камбалу. Известна способность осьминогов проникать через удивительно маленькие отверстия. Мозг осьминога высокоразвит (один из самых развитых среди беспозвоночных), имеет зачаточную кору. Осьминоги способны воспринимать звук, в том числе инфразвук. На каждой «руке» расположено до десяти тысяч вкусовых рецепторов, определяющих съедобность или несъедобность предмета.
Осьминоги обладают способностью мгновенно изменять окраску, и текстуру кожи (как хамелеон), в зависимости от состояния (маскировка, испуг, агрессия, брачные игры), приспосабливаясь к окружающей среде. 
Все виды осьминогов ядовиты. 

Длина взрослых особей составляет от 1 сантиметра до 4 метров. Осьминог Дофлейна может достигать длины 960 см и массы 270 кг, но обычно масса осьминогов не превышает нескольких десятков кг.
Продолжительность жизни осьминогов редко превышает 5 лет.
Одиночные животные, привязаны к своей территории. Часто селятся рядом с осьминогами такого же размера. Осьминоги убирают свой дом, складывая мусор и остатки пищи в кучки.
Большинство видов осьминогов ведёт придонный образ жизни, обитая среди камней, скал и водорослей. Днём осьминоги менее активны, чем ночью, поэтому их считают ночными животными.
Удирая, осьминоги многих видов выпускают струйки чернил — тёмной жидкости, вырабатываемой специальными железами. Эта жидкость повисает в воде в виде бесформенных полупрозрачных пятен и некоторое время держится компактно, пока не размоется водой.
Осминоги – хищники, они поедают моллюсков, ракообразных, рыбу. Добычу захватывают всеми восемью щупальцами. Осьминог своим клювом кусает жертву, удерживая её присосками. При этом яд слюнных желёз из глотки попадает в рану жертвы. 
В период размножения самка откладывает в гнездо (в норе или пещерке) на мелководье, до 80 тысяч яиц. Самка долго ухаживает за яйцами без еды, и часто умирает после вылупления молоди. 
Осьминогов многие зоопсихологи считают самыми «умными» среди всех беспозвоночных по многим показателям: они поддаются дрессировке, имеют хорошую память, различают геометрические фигуры, узнают людей, привыкают к тем, кто их кормит. Если проводить с осьминогом достаточно времени, он становится ручным.
В Красном море опасны синекольчатые осьминоги (фото 2), которые, несмотря на маленький размер (до 15 - 25 см), ядовиты, их укус часто безболезненный, но может привести к параличу дыхания, из-а нейротоксина (тетродотоксина). В спокойном состоянии они невзрачные, но при угрозе ярко сияют кольца. Опасность представляют и другие осьминоги, яд которых вызывает боль и опухоль, но синекольчатый осьминог — самый опасный, поэтому никогда нельзя трогать осьминогов руками. 
</div>
        </>
    }  

        if ('squids' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/squids/кальмары (4).jpg"
                />
                <FishImage
                    src="../image/no-fishes/squids/кальмар 0.jpg"
                />
                <FishImage
                    src="../image/no-fishes/squids/кальмары (5).jpg"
                />
                <FishImage
                    src="../image/no-fishes/squids/кальмары.jpg"
                />
            </div>
            <div className="Text-description"> Кальма́ры — отряд десятируких головоногих моллюсков. 
Кальмары широко распространены во всех океанах и морях с океанической соленостью — от Полярного круга до побережья Антарктиды. Наиболее многочисленны и разнообразны в тропических водах. Известно более 250 видов.
Тело представителей группы обтекаемой цилиндрической формы с двумя треугольными боковыми плавниками, обычно заостренное на заднем конце. Голова чётко отделена от туловища, на ней расположены щупальца с присосками и крючками. 
У всех представителей группы имеется радула для соскребания и размельчения пищи, и чернильная железа. Секрет, выделяемый ею, окрашивает воду и скрывает кальмаров при нападении хищников. 
Кожа покрыта контролируемыми хроматофорами разных цветов, что позволяет кальмарам подбирать окраску к окружающей среде. Игра цветов может дополнительно отвлечь добычу от приближающихся щупалец кальмара. Кожа также содержит отражатели света, которые при активации в течение миллисекунд создают изменяемые рисунки поляризованного света на коже. Такой кожный камуфляж может выполнять различные функции: коммуникация с находящимися поблизости кальмарами, обнаружение добычи, навигация и ориентация во время охоты или поиска убежища. 
Размеры представителей группы весьма разнообразны. Кроме мелких форм, не превышающих длиной нескольких сантиметров имеются гиганты. Гигантские кальмары могут вырастать до огромных размеров, их длина составляет до 8 м, и вес до 490 кг.
Кальмары откладывают яйца (до 200 тысяч) в капсулах, реже по одному, в воду или на дно. Самки некоторых видов держатся недалеко от своих кладок во время их развития, и, спустя некоторое время после нереста погибают, а кладки развиваются без присмотра родителей.
Встречаются как в поверхностных слоях, так и на больших глубинах. Некоторые виды совершают дальние нагульные и нерестовые миграции. Способны развивать большую скорость при охоте на добычу или спасаясь от хищников. Плавают при помощи плавников и реактивно — резко выбрасывают воду из своей мантийной полости через воронку, поворачивая которую они способны маневрировать, двигаться назад и вперед. 
Все кальмары — хищники. Кальмары потребляют массу зоопланктонных организмов, мелкой рыбы и других кальмаров. Океанические кальмары питаются массовыми светящимися анчоусами, которые составляют значительную часть их рациона. Суточные вертикальные миграции для охоты свойственны большинству батипелагических кальмаров.
В свою очередь кальмарами питаются многие виды рыб, китообразные, ластоногие, морские птицы. Молодь кальмаров поедают медузы, сифонофоры, щетинкочелюстные, другие кальмары, морские черепахи.

Кальмары Красного моря для дайверов не представляют опасности.
</div>
        </>
    }  

        if ('hedgehog' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/stars/еж  (5).jpg"
                />
                <FishImage
                    src="../image/no-fishes/stars/еж.jpg"
                />
                <FishImage
                    src="../image/no-fishes/stars/морской еж.jpg"
                />
                <FishImage
                    src="../image/no-fishes/stars/еж1.jpg"
                />
            </div>
            <div className="Text-description">Морски́е ежи́ — класс иглокожих. 
Широко распространены в океанах и морях с нормальной солёностью на глубинах до 7 км, особенно на коралловых рифах тропических морей.
 Описано около 800 современных видов. 
В Красном море обитает множество видов морских ежей, которые играют ключевую роль в поддержании здоровья коралловых рифов, поедая излишки водорослей. Самые распространённые: Диадемовые ежи - у них очень длинные черные иглы (до 30 см), которые крайне хрупки и легко обламываются; Красноиглые морские ежи -отличаются яркими красноватыми иглами; Грифельные ежи - обладают толстыми, тупыми иглами, похожими на карандаши или мелки, не колючие; Трипнеустес - часто «маскируется», собирая на себя кусочки ракушек и водорослей.
Тело морских ежей обычно почти сферическое, размером от 2 - 3 до 30 см.
Встречаются разного размера и очень разнообразной яркой расцветки.
Морские ежи — донные ползающие или же зарывающиеся животные. Передвигаются с помощью амбулакральных ножек и игл. Морские ежи просверливают себе норы в скалах, даже гранитных и базальтовых, где прячутся во время отлива и от хищников. 
Практически всеядны. Рацион включает водоросли, губок, мшанок, асцидий и разнообразную падаль, а также моллюсков, мелких морских звёзд и даже других морских ежей. Живущие на мягком грунте виды заглатывают песок и ил, переваривая попадающие с ними мелкие организмы.
Морские ежи раздельнополы. Возраст морских ежей в среднем составляет 10 - 15 лет, максимум — до 35 лет.

Морские ежи не агрессивны в отношении человека, но многие виды ежей в Красном море ядовиты, а их иглы крайне хрупкие и снабжены зазубринами. При уколе игла обламывается внутри раны. Яд, проникающий через иглы, вызывает резкую жгучую боль, отек и покраснение.
Чтобы избежать травм, всегда используйте специальную обувь для купания («коралки») и внимательно смотрите под ноги, особенно на мелководье у рифов.
 
 </div>
        </>
    }  

        if ('turtles' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/turtles/морская черепаха 3.jpg"
                />
                <FishImage
                    src="../image/no-fishes/turtles/морская черепаха 9.jpg"
                />
                <FishImage
                    src="../image/no-fishes/turtles/морская черепаха 6.jpg"
                />
                <FishImage
                    src="../image/no-fishes/turtles/морская черепаха.jpg"
                />
            </div>
            <div className="Text-description"> </div>
        </>
    }  

         if ('stars' === fishName) {
        return <>
            <div className='Box'>
                <FishImage
                    src="../image/no-fishes/stars/морская звезда 2.jpg"
                />
                <FishImage
                    src="../image/no-fishes/stars/морская звезда 6.jpg"
                />
                <FishImage
                    src="../image/no-fishes/stars/звезда2.jpg"
                />
                <FishImage
                    src="../image/no-fishes/stars/морская звезда 8.jpg"
                />
            </div>
            <div className="Text-description"> </div>
        </>
    }  




    return <></>
}
